Repository: dotnet/corefx
Catalog: src/Microsoft.CSharp/src/MultilingualResources/Microsoft.CSharp.*.xlf
Languages: de, es, ko

# InternalCompilerError
source: An unexpected exception occurred while binding a dynamic operation
de: Unerwartete Ausnahme beim Binden eines dynamischen Vorgangs
es: Excepción inesperada al enlazar una operación dinámica.
ko: 동적 작업을 바인딩하는 동안 예기치 않은 예외가 발생했습니다.

# BindRequireArguments
source: Cannot bind call with no calling object
de: Ein Aufruf ohne aufrufendes Objekt kann nicht gebunden werden.
es: No se puede enlazar la llamada sin un objeto de llamada.
ko: 호출 개체가 없으면 호출을 바인딩할 수 없습니다.

# BindCallFailedOverloadResolution
source: Overload resolution failed
de: Fehler bei der Überladungsauflösung
es: Error en la resolución de sobrecarga.
ko: 오버로드 확인에 실패했습니다.

# BindBinaryOperatorRequireTwoArguments
source: Binary operators must be invoked with two arguments
de: Binäre Operatoren müssen mit zwei Argumenten aufgerufen werden.
es: No se pueden invocar operadores binarios con dos argumentos.
ko: 이항 연산자를 호출하려면 인수 두 개를 사용해야 합니다.

# BindUnaryOperatorRequireOneArgument
source: Unary operators must be invoked with one argument
de: Unäre Operatoren müssen mit einem Argument aufgerufen werden.
es: Los operadores unarios deben invocarse con un argumento.
ko: 단항 연산자를 호출하려면 인수 한 개를 사용해야 합니다.

# BindPropertyFailedMethodGroup
source: The name '{0}' is bound to a method and cannot be used like a property
de: Der Name "{0}" ist an eine Methode gebunden und kann nicht wie eine Eigenschaft verwendet werden.
es: El nombre '{0}' está enlazado a un método y no se puede usar como propiedad.
ko: 이름 '{0}'은(는) 메서드에 바인딩되어 있으며 속성처럼 사용할 수 없습니다.

# BindInvokeFailedNonDelegate
source: Cannot invoke a non-delegate type
de: Ein Nichtdelegattyp kann nicht aufgerufen werden.
es: No se puede invocar un tipo no delegado.
ko: 비대리자 형식을 호출할 수 없습니다.

# BindImplicitConversionRequireOneArgument
source: Implicit conversion takes exactly one argument
de: Eine implizite Konvertierung akzeptiert genau ein Argument.
es: La conversión implícita toma exactamente un argumento.
ko: 암시적 변환에서는 정확히 하나의 인수를 사용합니다.

# BindExplicitConversionRequireOneArgument
source: Explicit conversion takes exactly one argument
de: Eine explizite Konvertierung akzeptiert genau ein Argument.
es: La conversión explícita toma exactamente un argumento.
ko: 명시적 변환에서는 정확히 하나의 인수를 사용합니다.

# BindBinaryAssignmentRequireTwoArguments
source: Binary operators cannot be invoked with one argument
de: Binäre Operatoren können nicht mit einem Argument aufgerufen werden.
es: No se pueden invocar operadores binarios con un argumento.
ko: 하나의 인수를 사용하여 이항 연산자를 호출할 수 없습니다.

# BindBinaryAssignmentFailedNullReference
source: Cannot perform member assignment on a null reference
de: Für einen NULL-Verweis kann keine Memberzuweisung ausgeführt werden.
es: No se puede realizar la asignación de miembros en una referencia NULL.
ko: null 참조에 대해 멤버 할당을 수행할 수 없습니다.

# NullReferenceOnMemberException
source: Cannot perform runtime binding on a null reference
de: Die Laufzeitbindung kann für einen NULL-Verweis nicht ausgeführt werden.
es: No se puede realizar enlace en tiempo de ejecución en una referencia NULL.
ko: null 참조에 대해 런타임 바인딩을 수행할 수 없습니다.

# BindCallToConditionalMethod
source: Cannot dynamically invoke method '{0}' because it has a Conditional attribute
de: Die {0}-Methode kann nicht dynamisch aufgerufen werden, da sie ein Conditional-Attribut enthält.
es: No se puede invocar dinámicamente el método '{0}' porque tiene un atributo Conditional.
ko: '{0}' 메서드는 Conditional 특성이 있으므로 동적으로 호출할 수 없습니다.

# BindToVoidMethodButExpectResult
source: Cannot implicitly convert type 'void' to 'object'
de: Der Typ "void" kann nicht implizit in "object" konvertiert werden.
es: No se puede convertir implícitamente el tipo 'void' en 'object'.
ko: 암시적으로 'void' 형식을 'object' 형식으로 변환할 수 없습니다.

# BadBinaryOps
source: Operator '{0}' cannot be applied to operands of type '{1}' and '{2}'
de: Der {0}-Operator kann nicht auf Operanden vom Typ "{1}" und "{2}" angewendet werden.
es: El operador '{0}' no se puede aplicar a operandos del tipo '{1}' y '{2}'
ko: '{0}' 연산자는 '{1}' 및 '{2}' 형식의 피연산자에 적용할 수 없습니다.

# BadIndexLHS
source: Cannot apply indexing with [] to an expression of type '{0}'
de: Eine Indizierung mit [] kann nicht auf einen Ausdruck vom Typ "{0}" angewendet werden.
es: No se puede aplicar la indización con [] a una expresión del tipo '{0}'
ko: []을 사용하는 인덱싱을 '{0}' 형식의 식에 적용할 수 없습니다.

# BadIndexCount
source: Wrong number of indices inside []; expected '{0}'
de: Falsche Indexanzahl in []. {0} wurde erwartet
es: Número incorrecto de índices dentro de []; se esperaba '{0}'
ko: [] 내부의 인덱스 수가 잘못되었습니다. '{0}'개가 필요합니다.

# BadUnaryOp
source: Operator '{0}' cannot be applied to operand of type '{1}'
de: Der {0}-Operator kann nicht auf einen Operanden vom Typ "{1}" angewendet werden.
es: El operador '{0}' no se puede aplicar al operando del tipo '{1}'
ko: '{0}' 연산자는 '{1}' 형식의 피연산자에 적용할 수 없습니다.

# NoImplicitConv
source: Cannot implicitly convert type '{0}' to '{1}'
de: Der {0}-Typ kann nicht implizit in {1} konvertiert werden.
es: No se puede convertir implícitamente el tipo '{0}' en '{1}'.
ko: 암시적으로 '{0}' 형식을 '{1}' 형식으로 변환할 수 없습니다.

# NoExplicitConv
source: Cannot convert type '{0}' to '{1}'
de: Der {0}-Typ kann nicht in {1} konvertiert werden.
ko: '{0}' 형식을 '{1}' 형식으로 변환할 수 없습니다.

# ConstOutOfRange
source: Constant value '{0}' cannot be converted to a '{1}'
de: Der Konstantenwert "{0}" kann nicht in {1} konvertiert werden.
es: El valor constante '{0}' no se puede convertir en '{1}'
ko: 상수 값 '{0}'을(를) '{1}'(으)로 변환할 수 없습니다.

# AmbigBinaryOps
source: Operator '{0}' is ambiguous on operands of type '{1}' and '{2}'
de: Der {0}-Operator ist bei Operanden vom Typ "{1}" und "{2}" mehrdeutig.
es: El operador '{0}' es ambiguo en operandos del tipo '{1}' y '{2}'
ko: '{0}' 연산자가 모호하여 '{1}' 및 '{2}' 형식의 피연산자에 사용할 수 없습니다.

# AmbigUnaryOp
source: Operator '{0}' is ambiguous on an operand of type '{1}'
de: Der {0}-Operator ist für einen Operanden vom Typ "{1}" mehrdeutig.
es: El operador '{0}' es ambiguo con un operando del tipo '{1}'
ko: '{0}' 연산자가 모호하여 '{1}' 형식의 피연산자에 사용할 수 없습니다.

# ValueCantBeNull
source: Cannot convert null to '{0}' because it is a non-nullable value type
de: NULL kann nicht in {0} konvertiert werden, da dieser Werttyp nicht auf NULL festgelegt werden kann.
es: No se puede convertir NULL en '{0}' porque es un tipo de valor que no acepta valores NULL.
ko: '{0}'은(는) null을 허용하지 않는 값 형식이므로 null을 이 형식으로 변환할 수 없습니다.

# WrongNestedThis
source: Cannot access a non-static member of outer type '{0}' via nested type '{1}'
de: Auf einen nicht statischen Member des äußeren {0}-Typs kann nicht über den geschachtelten {1}-Typ zugegriffen werden.
es: No se puede obtener acceso a un miembro no estático de tipo externo '{0}' mediante el tipo anidado '{1}'.
ko: 중첩 형식 '{1}'을(를) 통해 외부 형식 '{0}'의 static이 아닌 멤버에 액세스할 수 없습니다.

# NoSuchMember
source: '{0}' does not contain a definition for '{1}'
de: {0} enthält keine Definition für {1}.
es: '{0}' no contiene una definición para '{1}'.
ko: '{0}'에 '{1}'에 대한 정의가 없습니다.

# ObjectRequired
source: An object reference is required for the non-static field, method, or property '{0}'
de: Für das nicht statische Feld, die Methode oder die Eigenschaft "{0}" ist ein Objektverweis erforderlich.
es: Se requiere una referencia de objeto para el campo, método o propiedad no estáticos '{0}'.
ko: static이 아닌 필드, 메서드 또는 속성 '{0}'에 개체 참조가 필요합니다.

# AmbigCall
source: The call is ambiguous between the following methods or properties: '{0}' and '{1}'
de: Der Aufruf unterscheidet nicht eindeutig zwischen den folgenden Methoden oder Eigenschaften: {0} und {1}
es: La llamada es ambigua entre los métodos o propiedades siguientes: '{0}' y '{1}'
ko: 다음 메서드 또는 속성 사이의 호출이 모호합니다. '{0}'과(와) '{1}'

# BadAccess
source: '{0}' is inaccessible due to its protection level
de: Der Zugriff auf "{0}" ist aufgrund des Schutzgrads nicht möglich.
es: '{0}' no es accesible debido a su nivel de protección
ko: 보호 수준 때문에 '{0}'에 액세스할 수 없습니다.

# MethDelegateMismatch
source: No overload for '{0}' matches delegate '{1}'
de: Keine Überladung für {0} stimmt mit dem Delegaten "{1}" überein.
es: Ninguna sobrecarga correspondiente a '{0}' coincide con el '{1}' delegado
ko: '{1}' 대리자와 일치하는 '{0}'에 대한 오버로드가 없습니다.

# AssgLvalueExpected
source: The left-hand side of an assignment must be a variable, property or indexer
de: Die linke Seite einer Zuweisung muss eine Variable, eine Eigenschaft oder ein Indexer sein.
es: La parte izquierda de una asignación debe ser una variable, una propiedad o un indizador
ko: 할당식의 왼쪽은 변수, 속성 또는 인덱서여야 합니다.

# NoConstructors
source: The type '{0}' has no constructors defined
de: Für den {0}-Typ sind keine Konstruktoren definiert.
es: El tipo '{0}' no tiene constructores definidos.
ko: '{0}' 형식에 정의된 생성자가 없습니다.

# BadDelegateConstructor
source: The delegate '{0}' does not have a valid constructor
de: Der Delegat "{0}" enthält keinen gültigen Konstruktor.
es: El delegado '{0}' no tiene un constructor válido
ko: '{0}' 대리자에 올바른 생성자가 없습니다.

# PropertyLacksGet
source: The property or indexer '{0}' cannot be used in this context because it lacks the get accessor
de: Die Eigenschaft oder der Indexer "{0}" kann in diesem Kontext nicht verwendet werden, weil der get-Accessor fehlt.
es: La propiedad o el indizador '{0}' no se puede usar en este contexto porque carece del descriptor de acceso get.
ko: '{0}' 속성 또는 인덱서는 get 접근자가 없으므로 이 컨텍스트에서 사용할 수 없습니다.

# ObjectProhibited
source: Member '{0}' cannot be accessed with an instance reference; qualify it with a type name instead
de: Auf den Member "{0}" kann nicht mit einem Instanzverweis zugegriffen werden. Qualifizieren Sie ihn stattdessen mit einem Typnamen.
es: No se puede obtener acceso al miembro '{0}' con una referencia de instancia; califíquelo con un nombre de tipo en su lugar.
ko: '{0}' 멤버는 인스턴스 참조를 사용하여 액세스할 수 없습니다. 대신 형식 이름을 사용하여 한정하십시오.

# AssgReadonly
source: A readonly field cannot be assigned to (except in a constructor or a variable initializer)
de: Einem schreibgeschützten Feld kann nichts zugewiesen werden (außer in einem Konstruktor oder Variableninitialisierer).
es: No se puede asignar un campo de sólo lectura (excepto en un constructor o inicializador de variable)
ko: 읽기 전용 필드에는 할당할 수 없습니다. 단 생성자 또는 변수 이니셜라이저에서는 예외입니다.

# RefReadonly
source: A readonly field cannot be passed ref or out (except in a constructor)
de: Einem schreibgeschützten Feld kann kein Verweis und keine Ausgabe übergeben werden (außer in einem Konstruktor).
es: No se puede pasar out o ref a un campo de sólo lectura (excepto en un constructor)
ko: 읽기 전용 필드는 ref 또는 out으로 전달할 수 없습니다. 단 생성자에서는 예외입니다.

# AssgReadonlyStatic
source: A static readonly field cannot be assigned to (except in a static constructor or a variable initializer)
de: Einem statischen, schreibgeschützten Feld kann nichts zugewiesen werden (außer in einem statischen Konstruktor oder einem Variableninitialisierer).
es: No se puede asignar un campo de sólo lectura estático (excepto en un constructor estático o inicializador de variable)
ko: 정적 읽기 전용 필드에는 할당할 수 없습니다. 단 정적 생성자 또는 변수 이니셜라이저에서는 예외입니다.

# RefReadonlyStatic
source: A static readonly field cannot be passed ref or out (except in a static constructor)
de: Einem statischen, schreibgeschützten Feld kann kein Verweis und keine Ausgabe übergeben werden (außer in einem statischen Konstruktor)
es: No se puede pasar out o ref a un campo estático de sólo lectura (excepto en un constructor estático)
ko: 정적 읽기 전용 필드는 ref 또는 out으로 전달할 수 없습니다. 단 정적 생성자에서는 예외입니다.

# AssgReadonlyProp
source: Property or indexer '{0}' cannot be assigned to -- it is read only
de: Für die Eigenschaft oder den Indexer "{0}" ist eine Zuweisung nicht möglich -- sie sind schreibgeschützt.
es: No se puede asignar a la propiedad o el indizador '{0}' porque es de solo lectura
ko: '{0}' 속성 또는 인덱서는 읽기 전용이므로 할당할 수 없습니다.

# AbstractBaseCall
source: Cannot call an abstract base member: '{0}'
de: Ein abstrakter Basismember kann nicht aufgerufen werden: '{0}'
es: No se puede llamar a un miembro base abstracto: '{0}'
ko: 추상 기본 멤버를 호출할 수 없습니다. '{0}'

# RefProperty
source: A property or indexer may not be passed as an out or ref parameter
de: Eine Eigenschaft oder ein Indexer kann nicht als out- oder ref-Parameter übergeben werden.
es: Una propiedad o un indizador no se puede pasar como parámetro out o ref
ko: 속성 또는 인덱서는 out 또는 ref 매개 변수로 전달할 수 없습니다.

# ManagedAddr
source: Cannot take the address of, get the size of, or declare a pointer to a managed type ('{0}')
de: Es ist nicht möglich, einen Zeiger für den verwalteten Typ ({0}) zu deklarieren oder dessen Adresse oder Größe abzurufen.
es: No se puede adquirir la dirección, obtener el tamaño ni declarar un puntero a un tipo administrado ('{0}')
ko: 관리되는 형식('{0}')의 주소 또는 크기를 가져오거나 해당 형식에 대한 포인터를 선언할 수 없습니다.

# FixedNotNeeded
source: You cannot use the fixed statement to take the address of an already fixed expression
de: Sie können nicht die fixed-Anweisung verwenden, um die Adresse eines bereits festen Ausdrucks abzurufen.
es: No se puede utilizar la instrucción fixed para adquirir la dirección de una expresión de tipo fixed
ko: 이미 고정된 식의 주소를 가져오는 데 fixed 문을 사용할 수 없습니다.

# UnsafeNeeded
source: Dynamic calls cannot be used in conjunction with pointers
de: Dynamische Aufrufe können nicht in Verbindung mit Zeigern verwendet werden.
es: No se pueden usar llamadas dinámicas en combinación con los punteros.
ko: 동적 호출을 포인터와 함께 사용할 수 없습니다.

# BadBoolOp
source: In order to be applicable as a short circuit operator a user-defined logical operator ('{0}') must have the same return type as the type of its 2 parameters
de: Um als Kurzschlussoperator anwendbar zu sein, muss der Rückgabetyp eines benutzerdefinierten logischen Operators ({0}) mit dem Typ seiner zwei Parameter übereinstimmen.
es: Para que se pueda aplicar un operador de cortocircuito, el operador lógico definido por el usuario ('{0}') debe tener el mismo tipo de valor devuelto que sus dos parámetros
ko: 사용자 정의 논리 연산자('{0}')를 단락(short circuit) 연산자로 사용하려면 연산자의 두 매개 변수와 같은 형식을 반환해야 합니다.

# MustHaveOpTF
source: The type ('{0}') must contain declarations of operator true and operator false
de: Der Typ ({0}) muss Deklarationen des True- und des False-Operators enthalten.
es: El tipo ('{0}') debe incluir declaraciones de operador true y operador false.
ko: '{0}' 형식에는 true 및 false 연산자 선언이 있어야 합니다.

# CheckedOverflow
source: The operation overflows at compile time in checked mode
de: Vorgangsüberlauf zur Kompilierzeit im aktivierten Modus.

# ConstOutOfRangeChecked
source: Constant value '{0}' cannot be converted to a '{1}' (use 'unchecked' syntax to override)
de: Der Konstantenwert "{0}" kann nicht in {1} konvertiert werden (verwenden Sie zum Außerkraftsetzen die unchecked-Syntax).
es: El valor constante '{0}' no se puede convertir en '{1}' (use la sintaxis 'unchecked' para invalidar el valor)
ko: 상수 값 '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. 재정의하려면 'unchecked' 구문을 사용하십시오.

# AmbigMember
source: Ambiguity between '{0}' and '{1}'
de: Mehrdeutigkeit zwischen {0} und {1}
es: Ambigüedad entre '{0}' y '{1}'
ko: '{0}'과(와) '{1}' 사이에 모호성이 있습니다.

# SizeofUnsafe
source: '{0}' does not have a predefined size, therefore sizeof can only be used in an unsafe context (consider using System.Runtime.InteropServices.Marshal.SizeOf)
de: {0} enthält keine vordefinierte Größe, sizeof kann daher nur in einem ungeschützten Kontext verwendet werden (verwenden Sie ggf. System.Runtime.InteropServices.Marshal.SizeOf).
es: '{0}' no tiene un tamaño predefinido; por tanto, sizeof sólo se puede usar en un contexto no seguro (use System.Runtime.InteropServices.Marshal.SizeOf).
ko: '{0}'에 미리 정의된 크기가 없으므로 sizeof는 안전하지 않은 컨텍스트에서만 사용할 수 있습니다. System.Runtime.InteropServices.Marshal.SizeOf를 사용하십시오.

# FieldInitRefNonstatic
source: A field initializer cannot reference the non-static field, method, or property '{0}'
de: Ein Feldinitialisierer kann nicht auf das nicht statische Feld bzw. die nicht statische Methode oder Eigenschaft "{0}" verweisen.
es: Un inicializador de campo no puede hacer referencia al campo, método o propiedad no estáticos '{0}'
ko: 필드 이니셜라이저는 static이 아닌 필드, 메서드 또는 속성 '{0}'을(를) 참조할 수 없습니다.

# CallingFinalizeDepracated
source: Destructors and object.Finalize cannot be called directly. Consider calling IDisposable.Dispose if available.
de: Destruktoren und object.Finalize können nicht direkt aufgerufen werden. Rufen Sie IDisposable.Dispose auf, sofern verfügbar.
es: Los destructores y object.Finalize no se pueden llamar directamente. Llame a IDisposable.Dispose si está disponible.
ko: 소멸자 및 object.Finalize는 직접 호출할 수 없습니다. 가능한 경우 IDisposable.Dispose를 호출하십시오.

# CallingBaseFinalizeDeprecated
source: Do not directly call your base class Finalize method. It is called automatically from your destructor.
de: Rufen Sie die Finalize-Methode Ihrer Basisklasse nicht direkt auf, da sie automatisch vom Destruktor aufgerufen wird.
es: No llame directamente al método Finalize de la clase base. Se llama automáticamente desde el destructor.
ko: 기본 클래스 Finalize 메서드를 직접 호출하지 마십시오. 이 메서드는 소멸자에서 자동으로 호출됩니다.

# BadCastInFixed
source: The right hand side of a fixed statement assignment may not be a cast expression
de: Die rechte Seite einer fixed-Anweisungszuweisung darf kein Umwandlungsausdruck sein.
es: El lado derecho de una asignación de instrucción fixed puede no ser una expresión de conversión
ko: fixed 문의 오른쪽에는 캐스트 식을 할당할 수 없습니다.

# NoImplicitConvCast
source: Cannot implicitly convert type '{0}' to '{1}'. An explicit conversion exists (are you missing a cast?)
de: Der {0}-Typ kann nicht implizit in {1} konvertiert werden. Es ist bereits eine explizite Konvertierung vorhanden (möglicherweise fehlt eine Umwandlung).
es: No se puede convertir implícitamente el tipo '{0}' en '{1}'. Ya existe una conversión explícita (compruebe si le falta una conversión).
ko: 암시적으로 '{0}' 형식을 '{1}' 형식으로 변환할 수 없습니다. 명시적 변환이 있습니다. 캐스트가 있는지 확인하십시오.

# InaccessibleGetter
source: The property or indexer '{0}' cannot be used in this context because the get accessor is inaccessible
de: Die Eigenschaft oder der Indexer "{0}" kann in diesem Kontext nicht verwendet werden, da nicht auf den get-Accessor zugegriffen werden kann.
es: La propiedad o indizador '{0}' no se puede usar en este contexto porque el descriptor de acceso get es inaccesible
ko: get 접근자에 액세스할 수 없으므로 '{0}' 속성 또는 인덱서는 이 컨텍스트에서 사용할 수 없습니다.

# InaccessibleSetter
source: The property or indexer '{0}' cannot be used in this context because the set accessor is inaccessible
de: Die Eigenschaft oder der Indexer "{0}" kann in diesem Kontext nicht verwendet werden, da nicht auf den set-Accessor zugegriffen werden kann.
es: La propiedad o indizador '{0}' no se puede usar en este contexto porque el descriptor de acceso set es inaccesible
ko: set 접근자에 액세스할 수 없으므로 '{0}' 속성 또는 인덱서는 이 컨텍스트에서 사용할 수 없습니다.

# BadArity
source: Using the generic {1} '{0}' requires '{2}' type arguments
de: Die Verwendung von {1} "{0}" (generisch) erfordert {2}-Typargumente.
es: Uso de {1} de tipo genérico ('{0}'): requiere '{2}' argumentos de tipo
ko: 제네릭 {1} '{0}'을(를) 사용하려면 '{2}' 형식 인수가 필요합니다.

# BadTypeArgument
source: The type '{0}' may not be used as a type argument
de: Der Typ "{0}" darf nicht als Typargument verwendet werden.
es: El tipo '{0}' no se puede usar como argumento de tipo
ko: '{0}' 형식은 형식 인수로 사용할 수 없습니다.

# TypeArgsNotAllowed
source: The {1} '{0}' cannot be used with type arguments
de: {1} "{0}" kann nicht mit Typargumenten verwendet werden.
es: {1} '{0}' no se puede usar con argumentos de tipo.
ko: {1} '{0}'은(는) 형식 인수와 함께 사용할 수 없습니다.

# HasNoTypeVars
source: The non-generic {1} '{0}' cannot be used with type arguments
de: {1} "{0}" ist nicht generisch und kann daher nicht mit Typargumenten verwendet werden.
es: Uso de {1} '{0}' de tipo no genérico: no se puede usar con argumentos de tipo
ko: 제네릭이 아닌 {1} '{0}'은(는) 형식 인수와 함께 사용할 수 없습니다.

# NewConstraintNotSatisfied
source: '{2}' must be a non-abstract type with a public parameterless constructor in order to use it as parameter '{1}' in the generic type or method '{0}'
de: {2} muss ein nicht abstrakter Typ mit einem öffentlichen parameterlosen Konstruktor sein, um im generischen Typ oder in der generischen {0}-Methode als {1}-Parameter verwendet werden zu können.
es: '{2}' debe ser un tipo no abstracto con un constructor público sin parámetros para poder usarlo como parámetro '{1}' en el tipo o método genérico '{0}'.
ko: 제네릭 형식 또는 메서드 '{0}'에서 '{1}' 매개 변수로 사용하려면 '{2}'이(가) 매개 변수가 없는 public 생성자를 사용하는 비추상 형식이어야 합니다.

# GenericConstraintNotSatisfiedRefType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no implicit reference conversion from '{3}' to '{1}'.
de: Der {3}-Typ kann nicht als {2}-Typparameter im generischen Typ oder in der generischen {0}-Methode verwendet werden. Es ist keine implizite Verweiskonvertierung von {3} in {1} vorhanden.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. No hay ninguna conversión de referencia implícita de '{3}' a '{1}'.
ko: '{3}' 형식은 제네릭 형식 또는 메서드 '{0}'에서 형식 매개 변수 '{2}'(으)로 사용할 수 없습니다. '{3}'에서 '{1}'(으)로의 암시적 참조 변환이 없습니다.

# GenericConstraintNotSatisfiedNullableEnum
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'.
de: Der {3}-Typ kann nicht als {2}-Typparameter im generischen Typ oder in der generischen {0}-Methode verwendet werden. Der {3}-Typ, der NULL-Werte zulässt, entspricht nicht der Einschränkung von {1}.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. El tipo que acepta valores NULL '{3}' no cumple la restricción de '{1}'.
ko: '{3}' 형식은 제네릭 형식 또는 메서드 '{0}'에서 형식 매개 변수 '{2}'(으)로 사용할 수 없습니다. nullable 형식 '{3}'이(가) '{1}' 제약 조건을 충족하지 않습니다.

# GenericConstraintNotSatisfiedNullableInterface
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'. Nullable types can not satisfy any interface constraints.
de: Der {3}-Typ kann nicht als {2}-Typparameter im generischen Typ oder in der generischen {0}-Methode verwendet werden. Der {3}-Typ, der NULL-Werte zulässt, entspricht nicht der Einschränkung von {1}. Typen, die NULL-Werte zulassen, können Schnittstelleneinschränkungen nicht entsprechen.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. El tipo que acepta valores NULL '{3}' no cumple la restricción de '{1}'. Los tipos que aceptan valores NULL no pueden cumplir restricciones de interfaz.
ko: '{3}' 형식은 제네릭 형식 또는 메서드 '{0}'에서 형식 매개 변수 '{2}'(으)로 사용할 수 없습니다. nullable 형식 '{3}'이(가) '{1}' 제약 조건을 충족하지 않습니다. nullable 형식은 어떠한 인터페이스 제약 조건도 만족할 수 없습니다.

# GenericConstraintNotSatisfiedTyVar
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion or type parameter conversion from '{3}' to '{1}'.
de: Der {3}-Typ kann nicht als {2}-Typparameter im generischen Typ oder in der generischen {0}-Methode verwendet werden. Es ist keine Boxing-Konvertierung oder Typparameterkonvertierung von {3} in {1} vorhanden.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. No hay conversión boxing ni conversión de parámetro de tipo de '{3}' a '{1}'.
ko: '{3}' 형식은 제네릭 형식 또는 메서드 '{0}'에서 형식 매개 변수 '{2}'(으)로 사용할 수 없습니다. '{3}'에서 '{1}'(으)로의 boxing 변환 또는 형식 매개 변수 변환이 없습니다.
