Repository: dotnet/corefx
Catalog: src/Microsoft.CSharp/src/MultilingualResources/Microsoft.CSharp.*.xlf
Languages: de, es, ko

# GenericConstraintNotSatisfiedValType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion from '{3}' to '{1}'.
de: Der {3}-Typ kann nicht als {2}-Typparameter im generischen Typ oder in der generischen {0}-Methode verwendet werden. Es ist keine Boxing-Konvertierung von {3} in {1} vorhanden.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. No hay conversión boxing de '{3}' a '{1}'.
ko: '{3}' 형식은 제네릭 형식 또는 메서드 '{0}'에서 형식 매개 변수 '{2}'(으)로 사용할 수 없습니다. '{3}'에서 '{1}'(으)로의 boxing 변환이 없습니다.

# TypeVarCantBeNull
source: Cannot convert null to type parameter '{0}' because it could be a non-nullable value type. Consider using 'default({0})' instead.
de: NULL kann nicht in den {0}-Typparameter konvertiert werden, da dieser Werttyp möglicherweise nicht auf NULL festgelegt werden kann. Verwenden Sie stattdessen ggf. default({0}).
es: No se puede convertir NULL en el parámetro de tipo '{0}' porque podría ser un tipo de valor que no acepta valores NULL. Use 'default({0})' en su lugar.
ko: null을 허용하지 않는 값 형식일 수 있으므로 null을 형식 매개 변수 '{0}'(으)로 변환할 수 없습니다. 대신 'default({0})'를 사용하십시오.

# BadRetType
source: '{1} {0}' has the wrong return type
de: Der Rückgabetyp von {1} {0} ist falsch.
es: '{1} {0}' es un tipo de valor devuelto equivocado
ko: '{1} {0}'에 잘못된 반환 형식이 있습니다.

# CantInferMethTypeArgs
source: The type arguments for method '{0}' cannot be inferred from the usage. Try specifying the type arguments explicitly.
de: Die Typargumente der {0}-Methode können nicht per Rückschluss aus der Syntax abgeleitet werden. Geben Sie die Typargumente explizit an.
es: Los argumentos de tipo para el método '{0}' no se pueden inferir a partir del uso. Intente especificar los argumentos de tipo explícitamente.
ko: '{0}' 메서드의 형식 인수를 유추할 수 없습니다. 형식 인수를 명시적으로 지정하십시오.

# MethGrpToNonDel
source: Cannot convert method group '{0}' to non-delegate type '{1}'. Did you intend to invoke the method?
de: Die {0}-Methodengruppe kann nicht in den Nichtdelegattyp "{1}" konvertiert werden. Wollten Sie die Methode aufrufen?
es: No se puede convertir el grupo de métodos '{0}' en tipo no delegado '{1}'. ¿Intentó invocar el método?
ko: '{0}' 메서드 그룹을 비대리자 형식 '{1}'(으)로 변환할 수 없습니다. 메서드를 호출하시겠습니까?

# RefConstraintNotSatisfied
source: The type '{2}' must be a reference type in order to use it as parameter '{1}' in the generic type or method '{0}'
de: Der {2}-Typ muss ein Referenztyp sein, damit er als {1}-Parameter im generischen Typ oder in der generischen {0}-Methode verwendet werden kann.
es: El tipo '{2}' debe ser un tipo de referencia para poder usarlo como parámetro '{1}' en el tipo o método genérico '{0}'.
ko: 제네릭 형식 또는 메서드 '{0}'에서 '{2}' 형식을 '{1}' 매개 변수로 사용하려면 해당 형식이 참조 형식이어야 합니다.

# ValConstraintNotSatisfied
source: The type '{2}' must be a non-nullable value type in order to use it as parameter '{1}' in the generic type or method '{0}'
de: Der {2}-Typ darf keine NULL-Werte zulassen, wenn er als {1}-Parameter im generischen Typ oder in der generischen {0}-Methode verwendet werden soll.
es: El tipo '{2}' debe ser un tipo de valor que no acepte valores NULL para poder usarlo como parámetro '{1}' en el tipo o método genérico '{0}'.
ko: 제네릭 형식 또는 메서드 '{0}'에서 '{2}' 형식을 '{1}' 매개 변수로 사용하려면 해당 형식이 null을 허용하지 않는 값 형식이어야 합니다.

# CircularConstraint
source: Circular constraint dependency involving '{0}' and '{1}'
de: Einschränkungsringabhängigkeit zwischen {0} und {1}
es: Dependencia de restricción circular que implica '{0}' y '{1}'
ko: '{0}' 및 '{1}'과(와) 관련된 순환 제약 조건 종속성입니다.

# BaseConstraintConflict
source: Type parameter '{0}' inherits conflicting constraints '{1}' and '{2}'
de: Der {0}-Typparameter erbt die in Konflikt stehenden Einschränkungen "{1}" und "{2}"
es: El parámetro de tipo '{0}' hereda las restricciones conflictivas '{1}' y '{2}'
ko: 형식 매개 변수 '{0}'이(가) 상속하는 '{1}' 및 '{2}' 제약 조건이 충돌합니다.

# ConWithValCon
source: Type parameter '{1}' has the 'struct' constraint so '{1}' cannot be used as a constraint for '{0}'
de: Der {1}-Typparameter enthält die Einschränkung "struct". {1} kann daher nicht als Einschränkung für {0} verwendet werden.
es: El parámetro de tipo '{1}' tiene la restricción 'struct'; por tanto, '{1}' no se puede usar como restricción para '{0}'
ko: 형식 매개 변수 '{1}'에 'struct' 제약 조건이 있으므로 '{1}'은(는) '{0}'에 대한 제약 조건으로 사용할 수 없습니다.

# AmbigUDConv
source: Ambiguous user defined conversions '{0}' and '{1}' when converting from '{2}' to '{3}'
de: Mehrdeutige benutzerdefinierte Konvertierungen von {0} und {1} bei der Konvertierung von {2} in {3}
es: Conversiones ambiguas definidas por el usuario '{0}' y '{1}' al convertir de '{2}' a '{3}'
ko: '{2}'에서 '{3}(으)로 변환하는 동안 모호한 사용자 정의 변환 '{0}' 및 '{1}'이(가) 발생했습니다.

# PredefinedTypeNotFound
source: Predefined type '{0}' is not defined or imported
de: Der vordefinierte {0}-Typ ist nicht definiert oder importiert.
es: El tipo predefinido '{0}' no está definido ni importado.
ko: 미리 정의된 형식 '{0}'을(를) 정의하지 않았거나 가져오지 않았습니다.

# PredefinedTypeBadType
source: Predefined type '{0}' is declared incorrectly
de: Der vordefinierte {0}-Typ wurde falsch deklariert.
es: Tipo predefinido '{0}' declarado incorrectamente.
ko: 미리 정의된 형식 '{0}'이(가) 잘못 선언되었습니다.

# BindToBogus
source: '{0}' is not supported by the language
de: {0} wird von der Sprache nicht unterstützt.
es: '{0}' no es compatible con el lenguaje
ko: '{0}'은(는) 언어에서 지원되지 않습니다.

# CantCallSpecialMethod
source: '{0}': cannot explicitly call operator or accessor
de: {0}: Der Operator oder Accessor kann nicht explizit aufgerufen werden.
es: '{0}': no se puede llamar explícitamente al operador o al descriptor de acceso
ko: '{0}': 연산자나 접근자를 명시적으로 호출할 수 없습니다.

# BogusType
source: '{0}' is a type not supported by the language
de: {0} ist ein Typ, der von der Sprache nicht unterstützt wird.
es: No se admite el tipo '{0}' para este lenguaje
ko: '{0}'은(는) 언어에서 지원하는 형식이 아닙니다.

# MissingPredefinedMember
source: Missing compiler required member '{0}.{1}'
de: Der vom Compiler angeforderte Member "{0}.{1}" fehlt.
es: Falta el miembro '{0}.{1}' que requiere el compilador.
ko: '{0}.{1}' 멤버를 필요로 하는 컴파일러가 없습니다.

# LiteralDoubleCast
source: Literal of type double cannot be implicitly converted to type '{1}'; use an '{0}' suffix to create a literal of this type
de: Literale vom Typ "double" können nicht implizit in den {1}-Typ konvertiert werden. Verwenden Sie ein {0}-Suffix, um ein Literal mit diesem Typ zu erstellen.
es: El literal de tipo double no se puede convertir implícitamente en el tipo '{1}'; use un sufijo '{0}' para crear un literal de este tipo
ko: double 형식의 리터럴을 암시적으로 '{1}' 형식으로 변환할 수 없습니다. 이 형식의 리터럴을 만들려면 '{0}' 접미사를 사용하십시오.

# UnifyingInterfaceInstantiations
source: '{0}' cannot implement both '{1}' and '{2}' because they may unify for some type parameter substitutions
de: {0} kann nicht gleichzeitig {1} und {2} implementieren, da diese für einige Typparameterersetzungen zusammengeführt werden können.
es: '{0}' no puede implementar tanto '{1}' como '{2}' porque se pueden unificar para algunas sustituciones de parámetros de tipo.
ko: '{1}'과(와) '{2}'은(는) 일부 형식 매개 변수를 대체할 때 통합될 수 있으므로 '{0}'에서 둘 다 구현할 수는 없습니다.

# ConvertToStaticClass
source: Cannot convert to static type '{0}'
de: Die Konvertierung in den statischen {0}-Typ ist nicht möglich.
es: No se puede convertir en el tipo estático '{0}'
ko: '{0}' 정적 형식으로 변환할 수 없습니다.

# GenericArgIsStaticClass
source: '{0}': static types cannot be used as type arguments
de: {0}: Statische Typen können nicht als Typargumente verwendet werden.
es: '{0}': los tipos estáticos no se pueden usar como argumentos de tipo
ko: '{0}': 정적 형식은 형식 인수로 사용할 수 없습니다.

# PartialMethodToDelegate
source: Cannot create delegate from method '{0}' because it is a partial method without an implementing declaration
de: Aus der {0}-Methode kann kein Delegat erstellt werden, da es sich um eine partielle Methode ohne implementierende Deklaration handelt.
es: No se puede crear un delegado a partir del método '{0}' porque es un método parcial sin una declaración de implementación.
ko: '{0}'은(는) 구현 선언이 없는 부분 메서드(Partial Method)이므로 이 메서드로부터 대리자를 만들 수 없습니다.

# IncrementLvalueExpected
source: The operand of an increment or decrement operator must be a variable, property or indexer
de: Der Operand eines Inkrement- oder Dekrementoperators muss eine Variable, eine Eigenschaft oder ein Indexer sein.
es: El operando de un operador de incremento o decremento debe ser una variable, una propiedad o un indizador
ko: 증가 연산자 또는 감소 연산자의 피연산자는 변수, 속성 또는 인덱서여야 합니다.

# NoSuchMemberOrExtension
source: '{0}' does not contain a definition for '{1}' and no extension method '{1}' accepting a first argument of type '{0}' could be found (are you missing a using directive or an assembly reference?)
de: {0} enthält keine Definition für {1}, und es konnte keine {1}-Erweiterungsmethode gefunden werden, die ein erstes Argument vom Typ "{0}" akzeptiert (möglicherweise fehlt eine Using-Direktive oder ein Assemblyverweis).
es: '{0}' no contiene una definición para '{1}' ni se encuentra ningún método de extensión '{1}' que acepte un primer argumento del tipo '{0}' (¿falta una directiva de uso o una referencia de ensamblado?).
ko: '{0}'에 '{1}'에 대한 정의가 없고 '{0}' 형식의 첫 번째 인수를 허용하는 확장 메서드 '{1}'을(를) 찾을 수 없습니다. using 지시문 또는 어셈블리 참조가 있는지 확인하십시오.

# ValueTypeExtDelegate
source: Extension methods '{0}' defined on value type '{1}' cannot be used to create delegates
de: Die im {1}-Werttyp definierten {0}-Erweiterungsmethoden können nicht zum Erstellen von Delegaten verwendet werden.
es: Los métodos de extensión '{0}' definidos en el tipo de valor '{1}' no se pueden usar para crear delegados.
ko: 값 형식 '{1}'에 정의된 확장 메서드 '{0}'은(는) 대리자를 만드는 데 사용할 수 없습니다.

# BadArgCount
source: No overload for method '{0}' takes '{1}' arguments
de: Keine Überladung für die {0}-Methode nimmt {1}-Argumente an.
es: Ninguna sobrecarga del método '{0}' toma argumentos '{1}'
ko: '{1}'개의 인수를 사용하는 '{0}' 메서드에 대한 오버로드가 없습니다.

# BadArgTypes
source: The best overloaded method match for '{0}' has some invalid arguments
de: Die beste Übereinstimmung für die überladene {0}-Methode enthält einige ungültige Argumente.
es: La mejor coincidencia de método sobrecargado para '{0}' tiene algunos argumentos no válidos
ko: '{0}'에 가장 일치하는 오버로드된 메서드에 잘못된 인수가 있습니다.

# BadArgType
source: Argument '{0}': cannot convert from '{1}' to '{2}'
de: {0}-Argument: Die Konvertierung von {1} in {2} ist nicht möglich.
es: Argumento '{0}': no se puede convertir de '{1}' a '{2}'
ko: '{0}' 인수: '{1}'에서 '{2}'(으)로 변환할 수 없습니다.

# RefLvalueExpected
source: A ref or out argument must be an assignable variable
de: Ein ref- oder out-Argument muss eine zuweisbare Variable sein.
es: Un argumento out o ref debe ser una variable asignable
ko: ref 또는 out 인수는 할당 가능한 변수여야 합니다.

# BadProtectedAccess
source: Cannot access protected member '{0}' via a qualifier of type '{1}'; the qualifier must be of type '{2}' (or derived from it)
de: Auf den geschützten Member "{0}" kann nicht über einen Qualifizierer vom Typ "{1}" zugegriffen werden. Der Qualifizierer muss vom Typ "{2}" (oder von ihm abgeleitet) sein.
es: No se puede obtener acceso al miembro protegido '{0}' mediante un calificador del tipo '{1}'; el calificador debe ser del tipo '{2}' (o derivado de éste)
ko: '{1}' 형식의 한정자를 통해 보호된 멤버 '{0}'에 액세스할 수 없습니다. 한정자는 '{2}' 형식이거나 여기에서 파생된 형식이어야 합니다.

# BindToBogusProp2
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor methods '{1}' or '{2}'
de: Die Eigenschaft, der Indexer oder das Ereignis "{0}" wird von der Sprache nicht unterstützt. Rufen Sie die {1}- oder {2}-Accessormethoden direkt auf.
es: El lenguaje no admite la propiedad, el indizador o el evento '{0}'; intente llamar directamente a los métodos de descriptor de acceso '{1}' o '{2}'
ko: '{0}' 속성, 인덱서 또는 이벤트는 이 언어에서 지원되지 않습니다. '{1}' 또는 '{2}' 접근자 메서드를 직접 호출해 보십시오.

# BindToBogusProp1
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor method '{1}'
de: Die Eigenschaft, der Indexer oder das Ereignis "{0}" wird von der Sprache nicht unterstützt. Rufen Sie die {1}-Accessormethode direkt auf.
es: El lenguaje no admite la propiedad, el indizador o el evento '{0}'; intente llamar directamente al método de descriptor de acceso '{1}'
ko: '{0}' 속성, 인덱서 또는 이벤트는 이 언어에서 지원되지 않습니다. '{1}' 접근자 메서드를 직접 호출해 보십시오.

# BadDelArgCount
source: Delegate '{0}' does not take '{1}' arguments
de: Der Delegat "{0}" akzeptiert {1}-Argumente nicht.
es: El delegado '{0}' no toma '{1}' argumentos
ko: '{0}' 대리자에는 '{1}'개의 인수를 사용할 수 없습니다.

# BadDelArgTypes
source: Delegate '{0}' has some invalid arguments
de: Der Delegat "{0}" enthält einige ungültige Argumente.
es: El delegado '{0}' tiene algunos argumentos no válidos
ko: '{0}' 대리자에 잘못된 인수가 있습니다.

# AssgReadonlyLocal
source: Cannot assign to '{0}' because it is read-only
de: {0} ist schreibgeschützt. Eine Zuweisung ist daher nicht möglich.
es: No se puede asignar a '{0}' porque es de solo lectura
ko: 읽기 전용인 '{0}'에는 할당할 수 없습니다.

# RefReadonlyLocal
source: Cannot pass '{0}' as a ref or out argument because it is read-only
de: {0} ist schreibgeschützt und kann daher nicht als ref- oder out-Argument übergeben werden.
es: No se puede pasar '{0}' como argumento out o ref porque es de solo lectura.
ko: '{0}'은(는) 읽기 전용이므로 ref 또는 out 인수로 전달할 수 없습니다.

# ReturnNotLValue
source: Cannot modify the return value of '{0}' because it is not a variable
de: Der Rückgabewert von {0} ist keine Variable und kann daher nicht geändert werden.
es: No se puede modificar el valor devuelto de '{0}' porque no es una variable.
ko: '{0}'은(는) 변수가 아니므로 해당 반환 값을 수정할 수 없습니다.

# BadArgExtraRef
source: Argument '{0}' should not be passed with the '{1}' keyword
de: Das {0}-Argument darf nicht mit dem {1}-Schlüsselwort übergeben werden.
es: No se debe pasar el argumento '{0}' con la palabra clave '{1}'
ko: '{0}' 인수는 '{1}' 키워드와 함께 전달할 수 없습니다.

# BadArgRef
source: Argument '{0}' must be passed with the '{1}' keyword
de: Das {0}-Argument muss mit dem {1}-Schlüsselwort übergeben werden.
es: El argumento '{0}' se debe pasar con la palabra clave '{1}'
ko: '{0}' 인수는 '{1}' 키워드와 함께 전달해야 합니다.

# AssgReadonly2
source: Members of readonly field '{0}' cannot be modified (except in a constructor or a variable initializer)
de: Member des schreibgeschützten Felds "{0}" können nicht geändert werden (außer in einem Konstruktor oder Variableninitialisierer).
es: Los miembros del campo de solo lectura '{0}' no se pueden modificar (excepto en un constructor o inicializador de variable)
ko: 읽기 전용 필드 '{0}'의 멤버는 수정할 수 없습니다. 단 생성자 또는 변수 이니셜라이저에서는 예외입니다.

# RefReadonly2
source: Members of readonly field '{0}' cannot be passed ref or out (except in a constructor)
de: An Member des schreibgeschützten Felds "{0}" können keine ref- oder out-Argumente übergeben werden (außer in einem Konstruktor).
es: No se puede pasar out o ref a los miembros del campo de solo lectura '{0}' (excepto en un constructor).
ko: 읽기 전용 필드 '{0}'의 멤버는 ref 또는 out으로 전달할 수 없습니다. 단 생성자에서는 예외입니다.

# AssgReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be assigned to (except in a static constructor or a variable initializer)
de: Für Felder eines statischen schreibgeschützten Felds "{0}" ist eine Zuweisung nicht möglich (außer in einem statischen Konstruktor oder einem Variableninitialisierer).
es: No se puede asignar a los campos del campo estático de solo lectura '{0}' (excepto en un constructor estático o un inicializador de variable)
ko: static 읽기 전용 필드 '{0}'의 필드에는 할당할 수 없습니다. 단 static 생성자 또는 변수 이니셜라이저에서는 예외입니다.

# RefReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be passed ref or out (except in a static constructor)
de: An Felder des schreibgeschützten Felds "{0}" können keine ref- oder out-Argumente übergeben werden (außer in einem Konstruktor).
es: No se puede pasar out o ref a los campos del campo estático de solo lectura '{0}' (excepto en un constructor estático).
ko: static 읽기 전용 필드 '{0}'의 필드는 ref 또는 out으로 전달할 수 없습니다. 단 static 생성자에서는 예외입니다.

# AssgReadonlyLocalCause
source: Cannot assign to '{0}' because it is a '{1}'
de: {0} ist ein(e) {1}. Eine Zuweisung ist daher nicht möglich.
es: No se puede asignar a '{0}' porque es '{1}'
ko: '{1}'인 '{0}'에는 할당할 수 없습니다.

# RefReadonlyLocalCause
source: Cannot pass '{0}' as a ref or out argument because it is a '{1}'
de: {0} ist ein(e) {1} und kann daher nicht als ref- oder out-Argument übergeben werden.
es: No se puede pasar '{0}' como argumento out o ref porque es '{1}'.
ko: '{0}'은(는) '{1}'이므로 ref 또는 out 인수로 전달할 수 없습니다.

# ThisStructNotInAnonMeth
source: Anonymous methods, lambda expressions, and query expressions inside structs cannot access instance members of 'this'. Consider copying 'this' to a local variable outside the anonymous method, lambda expression or query expression and using the local instead.
de: Anonyme Methoden, lambda-Ausdrücke und Abfrageausdrücke innerhalb von Strukturen können nicht auf Instanzmember von "this" zugreifen. Kopieren Sie "this" in eine lokale Variable außerhalb der anonymen Methode, des lambda-Ausdrucks oder des Abfrageausdrucks, und verwenden Sie die lokale Variable.
es: Los métodos anónimos, las expresiones lambda y las expresiones de consulta incluidos en structs no pueden obtener acceso a miembros de instancia de 'this'. Copie 'this' en una variable local fuera del método anónimo, la expresión lambda o la expresión de consulta y use la variable local en su lugar.
ko: 구조체 안의 무명 메서드, 람다 식 및 쿼리 식은 'this'의 인스턴스 멤버에 액세스할 수 없습니다. 'this'를 무명 메서드, 람다 식 또는 쿼리 식 외부에 있는 지역 변수에 복사한 다음 이 지역 변수를 대신 사용하십시오.

# BadCtorArgCount
source: '{0}' does not contain a constructor that takes '{1}' arguments
de: "{0}" enthält keinen Konstruktor, der {1}-Argumente akzeptiert.
es: '{0}' no contiene un constructor que tome '{1}' argumentos
ko: '{0}'에 '{1}'개의 인수를 사용하는 생성자가 없습니다.

# BadExtensionArgTypes
source: '{0}' does not contain a definition for '{1}' and the best extension method overload '{2}' has some invalid arguments
de: "{0}" enthält keine Definition für {1}, und die Überladung der optimalen {2}-Erweiterungsmethode enthält einige ungültige Argumente.
es: '{0}' no contiene una definición para '{1}' y la mejor sobrecarga del método de extensión '{2}' tiene algunos argumentos no válidos
ko: '{0}'에 '{1}'에 대한 정의가 없으며 가장 적합한 확장 메서드 오버로드 '{2}'에 잘못된 인수가 있습니다.

# BadInstanceArgType
source: Instance argument: cannot convert from '{0}' to '{1}'
de: Instanzenargument: Konvertierung von {0} in {1} ist nicht möglich.
es: Argumento de instancia: no se puede convertir de '{0}' a '{1}'
ko: 인스턴스 인수: '{0}'에서 '{1}'(으)로 변환할 수 없습니다.

# BadArgTypesForCollectionAdd
source: The best overloaded Add method '{0}' for the collection initializer has some invalid arguments
de: Die beste Übereinstimmung für die überladene {0}-Methode für den Auflistungsinitialisierer enthält einige ungültige Argumente.
es: El mejor método Add sobrecargado '{0}' del inicializador de colección tiene algunos argumentos no válidos
ko: 오버로드된 Add 메서드 중 해당 컬렉션 이니셜라이저에 가장 적합한 '{0}'에 잘못된 인수가 있습니다.

# InitializerAddHasParamModifiers
source: The best overloaded method match '{0}' for the collection initializer element cannot be used. Collection initializer 'Add' methods cannot have ref or out parameters.
de: Die beste Übereinstimmung für die überladene {0}-Methode für das Auflistungsinitialisiererelement kann nicht verwendet werden. Die Add-Methoden von Auflistungsinitialisierern dürfen keine ref- oder out-Parameter enthalten.
es: La mejor coincidencia de método sobrecargado '{0}' para el elemento inicializador de la colección no se puede usar. Los métodos 'Add' inicializadores de colección no pueden tener parámetros out o ref.
ko: 컬렉션 이니셜라이저에 대해 '{0}'에 가장 일치하는 오버로드된 메서드를 사용할 수 없습니다. 컬렉션 이니셜라이저 'Add' 메서드에는 ref 또는 out 매개 변수를 사용할 수 없습니다.

# NonInvocableMemberCalled
source: Non-invocable member '{0}' cannot be used like a method.
de: Der nicht aufrufbare Member "{0}" kann nicht wie eine Methode verwendet werden.
es: No se puede usar como método el miembro '{0}' no invocable.
ko: 호출할 수 없는 멤버인 '{0}'은(는) 메서드처럼 사용할 수 없습니다.

# NamedArgumentSpecificationBeforeFixedArgument
source: Named argument specifications must appear after all fixed arguments have been specified
de: Die Spezifikationen für benannte Argumente müssen nach Angabe aller festen Argumente angezeigt werden.
es: Las especificaciones de argumento con nombre deben aparecer después de haber especificado todos los argumentos fijos.
ko: 명명된 인수 사양은 모든 고정 인수를 지정한 다음에 와야 합니다.

# BadNamedArgument
source: The best overload for '{0}' does not have a parameter named '{1}'
de: Die beste Überladung für {0} enthält keinen Parameter mit dem Namen "{1}".
es: La mejor sobrecarga para '{0}' no tiene un parámetro denominado '{1}'
ko: '{0}'에 가장 적합한 오버로드에 '{1}' 매개 변수가 없습니다.

# BadNamedArgumentForDelegateInvoke
source: The delegate '{0}' does not have a parameter named '{1}'
de: Der Delegat "{0}" enthält keinen Parameter mit dem Namen "{1}".
es: El delegado '{0}' no tiene un parámetro denominado '{1}'
ko: '{0}' 대리자에 '{1}' 매개 변수가 없습니다.

# DuplicateNamedArgument
source: Named argument '{0}' cannot be specified multiple times
de: Das benannte {0}-Argument kann nicht mehrmals angegeben werden.
es: El argumento con nombre '{0}' no se puede especificar varias veces
ko: 명명된 인수 '{0}'을(를) 여러 번 지정할 수 없습니다.

# NamedArgumentUsedInPositional
source: Named argument '{0}' specifies a parameter for which a positional argument has already been given
de: Das benannte {0}-Argument legt einen Parameter fest, für den bereits ein positionelles Argument angegeben wurde.
es: El argumento con nombre '{0}' especifica un parámetro para el que ya se ha proporcionado un argumento posicional.
ko: 명명된 인수 '{0}'은(는) 위치 인수가 이미 지정된 매개 변수를 지정합니다.
