Repository: dotnet/corefx
Catalog: src/Microsoft.CSharp/src/Resources/Strings.*.resx
Languages: it, ru, zh_hant

# CantInferMethTypeArgs
source: The type arguments for method '{0}' cannot be inferred from the usage. Try specifying the type arguments explicitly.
it: Impossibile dedurre gli argomenti di tipo per il metodo '{0}' dall'utilizzo. Provare a specificare gli argomenti di tipo in modo esplicito.
ru: The type arguments for method "{0}" cannot be inferred from the usage. Попытайтесь явно определить аргументы-типы.
zh_hant: 方法 '{0}' 的型別引數不能從使用方式推斷。請嘗試明確指定型別引數。

# MethGrpToNonDel
source: Cannot convert method group '{0}' to non-delegate type '{1}'. Did you intend to invoke the method?
it: Impossibile convertire il gruppo di metodi '{0}' nel tipo non delegato '{1}'. Si desiderava richiamare il metodo?
ru: Не удается преобразовать группу методов "{0}" в тип, не являющийся делегатом "{1}". Предполагается ли вызывать этот метод?
zh_hant: 無法將方法群組 '{0}' 轉換為非委派型別 '{1}'。您是否想要叫用這個方法?

# RefConstraintNotSatisfied
source: The type '{2}' must be a reference type in order to use it as parameter '{1}' in the generic type or method '{0}'
it: È necessario che il tipo '{2}' sia un tipo di riferimento per essere utilizzato come parametro '{1}' nel tipo generico o nel metodo '{0}'
ru: Для использования в качестве параметра "{1}" в универсальном типе или методе "{0}" тип "{2}" должен быть ссылочным типом
zh_hant: 型別 '{2}' 必須是參考型別，才能在泛型型別或方法 '{0}' 中做為參數 '{1}' 使用

# ValConstraintNotSatisfied
source: The type '{2}' must be a non-nullable value type in order to use it as parameter '{1}' in the generic type or method '{0}'
it: Il tipo '{2}' deve essere un tipo di valore non nullable per poter essere utilizzato come parametro '{1}' nel metodo o nel tipo generico '{0}'
ru: Для использования в качестве параметра "{1}" в универсальном типе или методе "{0}" тип "{2}" должен быть типом значения, не допускающим значения NULL
zh_hant: 型別 '{2}' 必須是不可為 null 的實值型別，才能在泛型型別或方法 '{0}' 中做為參數 '{1}' 使用

# CircularConstraint
source: Circular constraint dependency involving '{0}' and '{1}'
it: Dipendenza di vincolo circolare che comprende '{0}' e '{1}'
ru: Циклическая зависимость ограничения, включающая "{0}" и "{1}"
zh_hant: 條件約束 '{0}' 和 '{1}' 循環相依; 必須移除兩者其中之一

# BaseConstraintConflict
source: Type parameter '{0}' inherits conflicting constraints '{1}' and '{2}'
it: Il parametro di tipo '{0}' eredita i vincoli in conflitto '{1}' e '{2}'
ru: Параметр типа "{0}" наследует конфликтующие ограничения "{1}" и "{2}"
zh_hant: 型別參數 '{0}' 繼承了衝突的條件約束 '{1}' 和 '{2}'

# ConWithValCon
source: Type parameter '{1}' has the 'struct' constraint so '{1}' cannot be used as a constraint for '{0}'
it: Il parametro di tipo '{1}' ha il vincolo 'struct'. Non è pertanto possibile utilizzare '{1}' come vincolo per '{0}'.
ru: Параметр типа "{1}" имеет ограничение "struct", поэтому "{1}" не может использоваться в качестве ограничения для "{0}"
zh_hant: 型別參數 '{1}' 有 'struct' 條件約束，因此 '{1}' 不能做為 '{0}' 的條件約束

# AmbigUDConv
source: Ambiguous user defined conversions '{0}' and '{1}' when converting from '{2}' to '{3}'
it: Conversioni '{0}' e '{1}' ambigue definite dall'utente durante la conversione da '{2}' a '{3}'
ru: Неоднозначные пользовательские преобразования "{0}" и "{1}" при преобразовании из "{2}" в "{3}"
zh_hant: 從 '{2}' 轉換為 '{3}' 時，發現模稜兩可的使用者定義轉換 '{0}' 和 '{1}'

# PredefinedTypeNotFound
source: Predefined type '{0}' is not defined or imported
it: Il tipo predefinito '{0}' non è definito né importato
ru: Предопределенный тип "{0}" не определен и не импортирован
zh_hant: 未定義或匯入預先定義的型別 '{0}'

# PredefinedTypeBadType
source: Predefined type '{0}' is declared incorrectly
it: Il tipo predefinito '{0}' è dichiarato in modo non corretto
ru: Предопределенный тип "{0}" объявлен неправильно
zh_hant: 預先定義的型別 '{0}' 宣告不正確

# BindToBogus
source: '{0}' is not supported by the language
it: '{0}' non è supportato dal linguaggio
ru: "{0}" не поддерживается языком
zh_hant: 此語言不支援 '{0}'

# CantCallSpecialMethod
source: '{0}': cannot explicitly call operator or accessor
it: '{0}': impossibile chiamare in modo esplicito l'operatore o la funzione di accesso
ru: "{0}": явный вызов оператора или метода доступа невозможен
zh_hant: '{0}': 無法明確呼叫運算子或存取子

# BogusType
source: '{0}' is a type not supported by the language
it: '{0}' è un tipo non supportato dal linguaggio
ru: "{0}" является типом, который не поддерживается в данном языке
zh_hant: 此語言不支援型別 '{0}'

# MissingPredefinedMember
source: Missing compiler required member '{0}.{1}'
it: Manca il membro '{0}.{1}', necessario per il compilatore.
ru: Отсутствует обязательный для компилятора член "{0}.{1}"
zh_hant: 遺漏編譯器所需的成員 '{0}.{1}'

# LiteralDoubleCast
source: Literal of type double cannot be implicitly converted to type '{1}'; use an '{0}' suffix to create a literal of this type
it: Impossibile convertire in modo implicito il valore letterale di tipo double nel tipo '{1}'. Utilizzare un suffisso '{0}' per creare un valore letterale di questo tipo
ru: Литерал с типом double не может быть неявно преобразован к типу "{1}"; для создания литерала этого типа следует воспользоваться суффиксом "{0}"
zh_hant: 不能隱含將型別 double 的常值轉換為型別 '{1}'; 請使用 '{0}' 後置字元來建立此型別的常值

# UnifyingInterfaceInstantiations
source: '{0}' cannot implement both '{1}' and '{2}' because they may unify for some type parameter substitutions
it: '{0}' non può implementare sia '{1}' che '{2}' perché potrebbero unificarsi per alcune sostituzioni di parametro di tipo.
ru: "{0}" не в состоянии реализовать как "{1}", так и "{2}", поскольку они могут быть идентичными для некоторых подстановок параметров-типов
zh_hant: '{0}' 不能同時實作 '{1}' 和 '{2}'，因為它們可能對某些型別參數的替代做整合

# ConvertToStaticClass
source: Cannot convert to static type '{0}'
it: Impossibile convertire nel tipo statico '{0}'
ru: Не удается выполнить преобразование к статическому типу "{0}"
zh_hant: 無法轉換為靜態型別 '{0}'

# GenericArgIsStaticClass
source: '{0}': static types cannot be used as type arguments
it: '{0}': i tipi statici non possono essere utilizzati come argomenti di tipi
ru: "{0}": нельзя использовать статические типы в качестве аргументов-типов
zh_hant: '{0}': 靜態型別不能當做型別引數使用

# PartialMethodToDelegate
source: Cannot create delegate from method '{0}' because it is a partial method without an implementing declaration
it: Impossibile creare un delegato dal metodo '{0}' perché è un metodo parziale senza una dichiarazione di implementazione
ru: Невозможно создать делегат на основе метода "{0}", поскольку он является разделяемым методом без реализующего объявления
zh_hant: 無法從方法 '{0}' 建立委派，因為它是沒有實作宣告的部分方法

# IncrementLvalueExpected
source: The operand of an increment or decrement operator must be a variable, property or indexer
it: L'operando di un operatore di incremento o decremento deve essere una variabile, una proprietà o un indicizzatore
ru: Операндом оператора инкремента или декремента должна быть переменная, свойство или индексатор
zh_hant: 遞增或遞減運算子的運算元必須是變數、屬性或索引子。

# NoSuchMemberOrExtension
source: '{0}' does not contain a definition for '{1}' and no extension method '{1}' accepting a first argument of type '{0}' could be found (are you missing a using directive or an assembly reference?)
it: '{0}' non contiene una definizione per '{1}' e non è stato trovato alcun metodo di estensione '{1}' che accetta un primo argomento di tipo '{0}'. Probabilmente manca una direttiva using o un riferimento a un assembly.
ru: "{0}" не содержит определения для "{1}", а найти метод расширения "{1}", принимающий первый аргумент типа "{0}", не удалось (возможно, пропущена директива using или ссылка на сборку)
zh_hant: '{0}' 不包含 '{1}' 的定義，也找不到擴充方法 '{1}' 來接受型別 '{0}' 的第一個引數 (您是否遺漏 using 指示詞或組件參考?)

# ValueTypeExtDelegate
source: Extension methods '{0}' defined on value type '{1}' cannot be used to create delegates
it: Impossibile utilizzare i metodi di estensione '{0}' definiti nel tipo di valore '{1}' per creare delegati
ru: Методы расширения "{0}", определенные для типа значения "{1}", не могут применяться для создания делегатов
zh_hant: 在實值型別 '{1}' 中定義的擴充方法 '{0}' 無法用來建立委派

# BadArgCount
source: No overload for method '{0}' takes '{1}' arguments
it: Nessun overload del metodo '{0}' accetta argomenti '{1}'
ru: Отсутствие перегрузки для метода "{0}" принимает"{1}" аргументы
zh_hant: 方法 '{0}' 沒有任何多載接受 '{1}' 個引數

# BadArgTypes
source: The best overloaded method match for '{0}' has some invalid arguments
it: La corrispondenza migliore del metodo di overload per '{0}' presenta alcuni argomenti non validi
ru: Наиболее подходящий перегруженный метод для "{0}" имеет несколько недопустимых аргументов
zh_hant: 最符合的多載方法 '{0}' 有一些無效的引數

# BadArgType
source: Argument '{0}': cannot convert from '{1}' to '{2}'
it: Argomento '{0}': impossibile eseguire la conversione da '{1}' a '{2}'
ru: Аргумент "{0}": невозможно преобразовать из "{1}" в "{2}"
zh_hant: 引數 '{0}': 無法從 '{1}' 轉換為 '{2}'

# RefLvalueExpected
source: A ref or out argument must be an assignable variable
it: Un argomento ref o out deve essere una variabile assegnabile.
ru: Аргумент с ключевым словом ref или out должен быть переменной, которой можно присвоить значение
zh_hant: ref 或 out 引數必須是可指派的變數

# BadProtectedAccess
source: Cannot access protected member '{0}' via a qualifier of type '{1}'; the qualifier must be of type '{2}' (or derived from it)
it: Impossibile accedere al membro protetto '{0}' tramite un qualificatore di tipo '{1}'. Il qualificatore deve essere di tipo '{2}' o derivato da esso.
ru: Не удается получить доступ к защищенному члену "{0}" через квалификатор типа "{1}"; квалификатор должен иметь тип "{2}" (или производный от него)
zh_hant: 無法經由型別 '{1}' 的限定詞來存取保護的成員 '{0}'; 必須經由型別 '{2}' (或從其衍生的型別) 的限定詞

# BindToBogusProp2
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor methods '{1}' or '{2}'
it: La proprietà, l'indicizzatore o l'evento '{0}' non è supportato dal linguaggio. Provare a chiamare direttamente il metodo '{1}' o '{2}' della funzione di accesso
ru: Свойство, индексатор или событие "{0}" не поддерживается в данном языке; попробуйте вызвать метод доступа "{1}" или "{2}"
zh_hant: 此語言不支援屬性、索引子或事件 '{0}'; 請試著直接呼叫存取子方法 '{1}' 或 '{2}'

# BindToBogusProp1
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor method '{1}'
it: La proprietà, l'indicizzatore o l'evento '{0}' non è supportato dal linguaggio. Provare a chiamare direttamente il metodo '{1}' della funzione di accesso
ru: Свойство, индексатор или событие "{0}" не поддерживается в данном языке; попробуйте вызвать метод доступа "{1}" или "{2}"
zh_hant: 此語言不支援屬性、索引子或事件 '{0}'; 請試著直接呼叫存取子方法 '{1}'

# BadDelArgCount
source: Delegate '{0}' does not take '{1}' arguments
it: Il delegato '{0}' non accetta argomenti '{1}'
ru: Делегат "{0}" не принимает аргументы "{1}"
zh_hant: 委派 '{0}' 不接受 '{1}' 個引數

# BadDelArgTypes
source: Delegate '{0}' has some invalid arguments
it: Il delegato '{0}' presenta alcuni argomenti non validi
ru: Делегат "{0}" имеет недопустимые аргументы
zh_hant: 委派 '{0}' 有一些無效的引數

# AssgReadonlyLocal
source: Cannot assign to '{0}' because it is read-only
it: Impossibile assegnare a '{0}' perché è di sola lettura
ru: Не удается выполнить присвоение параметру "{0}", так как он доступен только для чтения
zh_hant: 無法指派給 '{0}'，因為它是唯讀的

# RefReadonlyLocal
source: Cannot pass '{0}' as a ref or out argument because it is read-only
it: Impossibile passare '{0}' come argomento ref o out perché è di sola lettura
zh_hant: 無法將 '{0}' 當做 ref 或 out 引數傳遞，因為它是唯讀的

# ReturnNotLValue
source: Cannot modify the return value of '{0}' because it is not a variable
it: Impossibile modificare il valore restituito da '{0}' perché non è una variabile
zh_hant: 無法修改 '{0}' 的傳回值，因為它不是變數

# BadArgExtraRef
source: Argument '{0}' should not be passed with the '{1}' keyword
it: L'argomento '{0}' non deve essere passato con la parola chiave '{1}'
ru: Аргумент "{0}" должен быть передан с ключевым словом "{1}"
zh_hant: 傳遞引數 '{0}' 時不能包含 '{1}' 關鍵字

# BadArgRef
source: Argument '{0}' must be passed with the '{1}' keyword
it: L'argomento '{0}' deve essere passato con la parola chiave '{1}'
ru: Аргумент "{0}" должен быть передан с ключевым словом "{1}"
zh_hant: 傳遞引數 '{0}' 時必須包含 '{1}' 關鍵字

# AssgReadonly2
source: Members of readonly field '{0}' cannot be modified (except in a constructor or a variable initializer)
it: Impossibile modificare i membri del campo di sola lettura '{0}' (tranne che in un costruttore o in un inizializzatore di variabile)
ru: Члены поля "{0}", предназначенного только для чтения, могут быть изменены только в конструкторе или инициализаторе переменных
zh_hant: 唯讀欄位 '{0}' 的成員無法修改 (除非是在建構函式或變數初始設定式)

# RefReadonly2
source: Members of readonly field '{0}' cannot be passed ref or out (except in a constructor)
it: Impossibile passare i membri del campo di sola lettura '{0}' come argomento ref o out (tranne che in un costruttore)
zh_hant: ref 或 out 無法傳遞唯讀欄位 '{0}' 的成員 (除非是在建構函式中)

# AssgReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be assigned to (except in a static constructor or a variable initializer)
it: Impossibile effettuare un'assegnazione ai campi di un campo statico di sola lettura '{0}' (tranne che in un costruttore statico o in un inizializzatore di variabile)
ru: Присваивание значений полям доступного только для чтения статического поля "{0}" допускается только в статическом конструкторе и в инициализаторе переменных
zh_hant: 無法指派靜態唯讀欄位 '{0}' 的欄位 (除非是在靜態建構函式或變數初始設定式)

# RefReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be passed ref or out (except in a static constructor)
it: Impossibile passare un argomento ref o out ai campi di un campo statico di sola lettura '{0}' (tranne che in un costruttore statico)
zh_hant: ref 或 out 無法傳遞靜態唯讀欄位 '{0}' 的欄位 (除非是在靜態建構函式)

# AssgReadonlyLocalCause
source: Cannot assign to '{0}' because it is a '{1}'
it: Impossibile assegnare a '{0}' perché è '{1}'
ru: Не удается выполнить присвоение параметру "{0}", так как он является "{1}"
zh_hant: 無法指派給 '{0}'，因為它是 '{1}'

# RefReadonlyLocalCause
source: Cannot pass '{0}' as a ref or out argument because it is a '{1}'
it: Impossibile passare '{0}' come argomento ref o out perché è '{1}'
ru: Не удалось передать "{0}" как ссылку или аргумент out, так как это "{1}"
zh_hant: 無法將 '{0}' 當做 ref 或 out 引數傳遞，因為它是 '{1}'

# ThisStructNotInAnonMeth
source: Anonymous methods, lambda expressions, and query expressions inside structs cannot access instance members of 'this'. Consider copying 'this' to a local variable outside the anonymous method, lambda expression or query expression and using the local instead.
it: I metodi anonimi, le espressioni lambda e le espressioni di query all'interno delle strutture non possono accedere ai membri di istanza di 'this'. Si consiglia di copiare 'this' in una variabile locale all'esterno del metodo anonimo, dell'espressione lambda o dell'espressione di query e di utilizzare tale variabile locale.
ru: Анонимные методы, лямбда-выражения и выражения запроса внутри структуры не имеет доступа к членам экземпляра "this". Возможно, следует скопировать "this" в локальную переменную за пределами анонимного метода, лямбда-выражения или выражения запроса и использовать эту локальную переменную.
zh_hant: 結構內部的匿名方法、Lambda 運算式和查詢運算式無法存取 'this' 的執行個體成員。請考慮將 'this' 複製到匿名方法、Lambda 運算式或查詢運算式外部的區域變數，並改用這個區域變數。

# DelegateOnNullable
source: Cannot bind delegate to '{0}' because it is a member of 'System.Nullable<T>'
it: Non è possibile associare il delegato a '{0}' perché è un membro di 'System. Nullable<T>'
ru: Не удается привязать делегат '{0}', потому что он является членом «System.Nullable<T>»
zh_hant: 不能將委託綁定到 '{0}'，因為它是 'System.Nullable<T>' 成員

# BadCtorArgCount
source: '{0}' does not contain a constructor that takes '{1}' arguments
it: '{0}' non contiene un costruttore che accetta argomenti '{1}'
ru: "{0}" не содержит конструктор, принимающий аргументов: {1}
zh_hant: '{0}' 不包含接受 '{1}' 個引數的建構函式

# BadExtensionArgTypes
source: '{0}' does not contain a definition for '{1}' and the best extension method overload '{2}' has some invalid arguments
it: '{0}' non contiene una definizione per '{1}' e l'overload migliore del metodo di estensione '{2}' presenta alcuni argomenti non validi
ru: "{0}" не содержит определения для "{1}", наилучшая перегрузка метода расширения "{2}" имеет такие же недопустимые аргументы
zh_hant: '{0}' 不包含 '{1}' 的定義，而且最佳的擴充方法多載 '{2}' 有一些無效的引數

# BadInstanceArgType
source: Instance argument: cannot convert from '{0}' to '{1}'
it: Argomento dell'istanza: impossibile eseguire la conversione da '{0}' a '{1}'
ru: Instance argument: невозможно преобразовать из "{0}" в "{1}"
zh_hant: 執行個體引數: 無法從 '{0}' 轉換為 '{1}'

# BadArgTypesForCollectionAdd
source: The best overloaded Add method '{0}' for the collection initializer has some invalid arguments
it: Il miglior metodo Add di overload '{0}' per l'inizializzatore di raccolta presenta alcuni argomenti non validi
ru: Наиболее подходящий перегруженный метод Add "{0}" для инициализатора коллекции содержит недопустимые аргументы
zh_hant: 集合初始設定式的最佳多載 Add 方法 '{0}' 有一些無效的引數

# InitializerAddHasParamModifiers
source: The best overloaded method match '{0}' for the collection initializer element cannot be used. Collection initializer 'Add' methods cannot have ref or out parameters.
it: Impossibile utilizzare la corrispondenza migliore del metodo di overload '{0}' per l'elemento inizializzatore della raccolta. I metodi 'Add' dell'inizializzatore di raccolta non possono includere parametri ref o out.
ru: Наиболее подходящий перегруженный метод, соответствующий "{0}" для элемента инициализации коллекции не может быть использован. Методы инициализации коллекции "Add" не имеют ссылочных и выходных параметров.
zh_hant: 無法使用集合初始設定式項目之最符合的多載方法 '{0}'。集合初始設定式 'Add' 方法不能具有 ref 或 out 參數。

# NonInvocableMemberCalled
source: Non-invocable member '{0}' cannot be used like a method.
it: Impossibile utilizzare il membro non richiamabile '{0}' come metodo.
ru: Невызываемый член "{0}" не может использоваться как метод.
zh_hant: 非可叫用 (Non-invocable) 成員 '{0}' 不能做為方法使用。

# NamedArgumentSpecificationBeforeFixedArgument
source: Named argument specifications must appear after all fixed arguments have been specified
it: Le specifiche di argomenti denominati devono trovarsi dopo tutti gli argomenti fissi specificati
ru: Спецификации именованного аргумента должны появляться во всех указанных фиксированных аргументах
zh_hant: 具名引數規格必須出現在所有已指定的固定引數之後

# BadNamedArgument
source: The best overload for '{0}' does not have a parameter named '{1}'
it: Il miglior overload per '{0}' non contiene un parametro denominato '{1}'
ru: Наиболее подходящий перегруженный метод для "{0}" не имеет параметра "{1}"
zh_hant: '{0}' 的最佳多載沒有一個名為 '{1}' 的參數

# BadNamedArgumentForDelegateInvoke
source: The delegate '{0}' does not have a parameter named '{1}'
it: Il delegato '{0}' non dispone di un parametro denominato '{1}'
ru: Делегат "{0}" не имеет параметра "{1}"
zh_hant: 委派 '{0}' 沒有一個名為 '{1}' 的參數

# DuplicateNamedArgument
source: Named argument '{0}' cannot be specified multiple times
it: Impossibile specificare l'argomento denominato '{0}' più volte
ru: Не удается задать именованный аргумент "{0}" несколько раз
zh_hant: 具名引數 '{0}' 不可以多次指定

# NamedArgumentUsedInPositional
source: Named argument '{0}' specifies a parameter for which a positional argument has already been given
it: L'argomento denominato '{0}' specifica un parametro per cui è già stato fornito un argomento posizionale
ru: Именованный аргумент "{0}" задает параметр, для которого уже был установлен позиционный аргумент.
zh_hant: 具名引數 '{0}' 指定了已給定位置引數的參數
