Repository: dotnet/corefx
Catalog: src/Microsoft.CSharp/src/Resources/Strings.*.resx
Languages: it, ru, zh_hant

# InternalCompilerError
source: An unexpected exception occurred while binding a dynamic operation
it: Eccezione imprevista durante l'associazione di un'operazione dinamica
ru: Возникло непредвиденное исключение при выполнении привязки динамической операции
zh_hant: 繫結動態作業時發生意外的例外狀況

# BindRequireArguments
source: Cannot bind call with no calling object
it: Impossibile associare la chiamata senza oggetto chiamante
ru: Невозможно выполнить привязку вызова к невызывающему объекту
zh_hant: 無法繫結沒有呼叫物件的呼叫

# BindCallFailedOverloadResolution
source: Overload resolution failed
it: Risoluzione dell'overload non riuscita
ru: Сбой при разрешении перегрузки
zh_hant: 多載解析失敗

# BindBinaryOperatorRequireTwoArguments
source: Binary operators must be invoked with two arguments
it: Gli operatori binari devono essere richiamati con due argomenti
ru: Бинарные операторы должны вызываться с использованием двух аргументов
zh_hant: 必須以兩個引數叫用二元運算子

# BindUnaryOperatorRequireOneArgument
source: Unary operators must be invoked with one argument
it: Gli operatori unari devono essere richiamati con un solo argomento
ru: Унарные операторы должны быть вызваны с использованием одного аргумента
zh_hant: 必須以一個引數叫用一元運算子

# BindPropertyFailedMethodGroup
source: The name '{0}' is bound to a method and cannot be used like a property
it: Il nome '{0}' è associato a un metodo e non può essere utilizzato come una proprietà
ru: Для имени "{0}" выполнена привязка к методу. Невозможно использовать его как свойство
zh_hant: 名稱 '{0}' 已繫結至一個方法，因此不能當成屬性使用

# BindPropertyFailedEvent
source: The event '{0}' can only appear on the left hand side of +
it: L'evento '{0}' può trovarsi soltanto sul lato sinistro di +
ru: Событие «{0}» может появляться только на стороне левой руки +
zh_hant: 事件 '{0}' 只能出現在左邊的 +

# BindInvokeFailedNonDelegate
source: Cannot invoke a non-delegate type
it: Impossibile richiamare un tipo non delegato
ru: Не удалось вызвать тип, не являющийся делегатом
zh_hant: 無法叫用非委派型別

# BindImplicitConversionRequireOneArgument
source: Implicit conversion takes exactly one argument
it: Per la conversione implicita viene accettato un solo argomento
ru: Для неявного преобразования нужен строго один аргумент
zh_hant: 隱含轉換只接受一個引數

# BindExplicitConversionRequireOneArgument
source: Explicit conversion takes exactly one argument
it: Per la conversione esplicita viene accettato un solo argomento
ru: Для явного преобразования нужен строго один аргумент
zh_hant: 明確轉換只接受一個引數

# BindBinaryAssignmentRequireTwoArguments
source: Binary operators cannot be invoked with one argument
it: Impossibile richiamare operatori binari con un solo argomento
ru: Невозможно вызвать бинарные операторы с использованием одного аргумента
zh_hant: 無法以一個引數叫用二元運算子

# BindBinaryAssignmentFailedNullReference
source: Cannot perform member assignment on a null reference
it: Impossibile eseguire un'assegnazione membro su un riferimento Null
ru: Не удается выполнить присваивание члена по нулевой ссылке
zh_hant: 無法對 null 參考進行成員指派

# NullReferenceOnMemberException
source: Cannot perform runtime binding on a null reference
it: Impossibile eseguire un'associazione di runtime su un riferimento Null
ru: Не удается выполнить привязки исполняющей среды по нулевой ссылке
zh_hant: 無法對 null 參考進行執行階段繫結

# BindCallToConditionalMethod
source: Cannot dynamically invoke method '{0}' because it has a Conditional attribute
it: Impossibile richiamare in modo dinamico il metodo '{0}' perché contiene un attributo Conditional
ru: Не удается динамически вызвать метод "{0}", так как у него есть условный атрибут
zh_hant: 無法以動態方式叫用方法 '{0}'，因為它有 Conditional 屬性

# BindToVoidMethodButExpectResult
source: Cannot implicitly convert type 'void' to 'object'
it: Impossibile convertire il tipo 'void' in 'object' in modo implicito
ru: Нельзя неявно преобразовать тип "void" to "object"
zh_hant: 無法將 'void' 型別隱含轉換為 'object' 型別

# BadBinaryOps
source: Operator '{0}' cannot be applied to operands of type '{1}' and '{2}'
it: Impossibile applicare l'operatore '{0}' su operandi di tipo '{1}' e '{2}'
ru: Не удается применить оператор "{0}" к операндам типа "{1}" и "{2}"
zh_hant: 無法將運算子 '{0}' 套用至型別 '{1}' 和 '{2}' 的運算元

# IntDivByZero
source: Division by constant zero
it: Divisione per zero costante
ru: Деление на ноль постоянной
zh_hant: 常數零做除數

# BadIndexLHS
source: Cannot apply indexing with [] to an expression of type '{0}'
it: Impossibile applicare l'indicizzazione con [] a un'espressione di tipo '{0}'
ru: Невозможно применить индексирование через [] к выражению типа "{0}"
zh_hant: 無法套用有 [] 的索引至型別 '{0}' 的運算式

# BadIndexCount
source: Wrong number of indices inside []; expected '{0}'
it: Numero di indici errato in [], previsto '{0}'
ru: Неверное количество индексов внутри []; ожидалось "{0}"
zh_hant: [] 內的索引數目錯誤; 必須是 '{0}'

# BadUnaryOp
source: Operator '{0}' cannot be applied to operand of type '{1}'
it: Impossibile applicare l'operatore '{0}' sull'operando di tipo '{1}'
ru: Не удается применить операнд "{0}" типа "{1}"
zh_hant: 無法將運算子 '{0}' 套用至型別 '{1}' 的運算元

# NoImplicitConv
source: Cannot implicitly convert type '{0}' to '{1}'
it: Impossibile convertire in modo implicito il tipo '{0}' in '{1}'
ru: Не удается неявно преобразовать тип "{0}" в "{1}"
zh_hant: 無法將型別 '{0}' 隱含轉換為 '{1}'

# NoExplicitConv
source: Cannot convert type '{0}' to '{1}'
it: Impossibile convertire il tipo '{0}' a '{1}'
ru: Невозможно преобразовать тип "{0}" в "{1}"
zh_hant: 不能轉換類型 '{0}' 到 '{1}'

# ConstOutOfRange
source: Constant value '{0}' cannot be converted to a '{1}'
it: Impossibile convertire il valore costante '{0}' in '{1}'
ru: Постоянное значение "{0}" не может быть преобразовано в "{1}"
zh_hant: 無法將常數值 '{0}' 轉換為 '{1}'

# AmbigBinaryOps
source: Operator '{0}' is ambiguous on operands of type '{1}' and '{2}'
it: L'operatore '{0}' è ambiguo su operandi di tipo '{1}' e '{2}'
ru: Оператор "{0}" является неоднозначным по отношению к операндам типа "{1}" и "{2}"
zh_hant: 運算子 '{0}' 用在型別 '{1}' 和 '{2}' 的運算元上時其意義會模稜兩可

# AmbigUnaryOp
source: Operator '{0}' is ambiguous on an operand of type '{1}'
it: L'operatore '{0}' è ambiguo su un operando di tipo '{1}'
ru: Оператор "{0}" является неоднозначным по отношению к операнду типа "{1}"
zh_hant: 運算子 '{0}' 用在型別 '{1}' 的運算元上時其意義會模稜兩可

# ValueCantBeNull
source: Cannot convert null to '{0}' because it is a non-nullable value type
it: Impossibile convertire Null in '{0}' perché è un tipo di valore non nullable
zh_hant: 無法將 null 轉換成 '{0}'，因為它是不可為 null 的實值型別

# WrongNestedThis
source: Cannot access a non-static member of outer type '{0}' via nested type '{1}'
it: Impossibile accedere a un membro non statico di tipo outer '{0}' tramite il tipo annidato '{1}'
ru: Невозможно получить доступ к нестатическому члену внешнего типа "{0}" через вложенный тип "{1}"
zh_hant: 無法透過巢狀型別 '{1}' 存取外部型別 '{0}' 的非靜態成員

# NoSuchMember
source: '{0}' does not contain a definition for '{1}'
it: '{0}' non contiene una definizione per '{1}'
ru: "{0}" не содержит определения для "{1}"
zh_hant: '{0}' 不包含 '{1}' 的定義

# ObjectRequired
source: An object reference is required for the non-static field, method, or property '{0}'
it: È necessario specificare un riferimento a un oggetto per la proprietà, il metodo o il campo non statico '{0}'
ru: Для нестатического поля, метода или свойства "{0}" требуется ссылка на объект
zh_hant: 需要有物件參考才能使用非靜態欄位、方法或屬性 '{0}'

# AmbigCall
source: The call is ambiguous between the following methods or properties: '{0}' and '{1}'
it: Chiamata ambigua tra i seguenti metodi o proprietà: '{0}' e '{1}'
ru: Понятие "вызов" трактуется неоднозначно в следующих методах или свойствах: "{0}" и "{1}"
zh_hant: 在下列方法或屬性之間的呼叫模稜兩可: '{0}' 和 '{1}'

# BadAccess
source: '{0}' is inaccessible due to its protection level
it: '{0}' è inaccessibile a causa del livello di protezione.
ru: "{0}" недоступен из-за его уровня защиты
zh_hant: '{0}' 的保護層級導致無法對其進行存取

# MethDelegateMismatch
source: No overload for '{0}' matches delegate '{1}'
it: Nessun overload per '{0}' corrisponde al delegato '{1}'
ru: Нет перегрузки для "{0}", соответствующей делегату "{1}"
zh_hant: '{0}' 沒有任何多載符合 '{1}' 委派

# AssgLvalueExpected
source: The left-hand side of an assignment must be a variable, property or indexer
it: La parte sinistra di un'assegnazione deve essere una variabile, una proprietà o un indicizzatore
ru: Левая часть выражения присваивания должна быть переменной, свойством или индексатором
zh_hant: 指派的左方必須為變數、屬性或索引子

# NoConstructors
source: The type '{0}' has no constructors defined
it: Per il tipo '{0}' non sono definiti costruttori
ru: Для типа "{0}" нет определенных конструкторов
zh_hant: 型別 '{0}' 沒有已定義的建構函式

# BadDelegateConstructor
source: The delegate '{0}' does not have a valid constructor
it: Il delegato '{0}' non presenta un costruttore valido
ru: Делегат "{0}" не имеет допустимого конструктора
zh_hant: 委派 '{0}' 沒有有效的建構函式

# PropertyLacksGet
source: The property or indexer '{0}' cannot be used in this context because it lacks the get accessor
it: Impossibile utilizzare la proprietà o l'indicizzatore '{0}' in questo contesto perché manca la funzione di accesso get.
zh_hant: 無法於此內容中使用屬性或索引子 '{0}'，因為其欠缺 get 存取子

# ObjectProhibited
source: Member '{0}' cannot be accessed with an instance reference; qualify it with a type name instead
it: Impossibile accedere al membro '{0}' con un riferimento a un'istanza. Qualificarlo con un nome di tipo
ru: Доступ к члену "{0}" через ссылку на экземпляр невозможен; вместо этого уточните его, указав имя типа
zh_hant: 成員 '{0}' 無法以執行個體參考存取; 請使用型別名稱代替

# AssgReadonly
source: A readonly field cannot be assigned to (except in a constructor or a variable initializer)
it: Un campo readonly non può essere assegnato (tranne che in un costruttore o in un inizializzatore di variabile).
ru: Присваивание значений доступному только для чтения полю допускается только в конструкторе и в инициализаторе переменных
zh_hant: 無法指定唯讀欄位 (除非在建構函式或變數初始設定式)

# RefReadonly
source: A readonly field cannot be passed ref or out (except in a constructor)
it: Un campo readonly non può essere passato a un parametro ref o out (tranne che in un costruttore)
ru: Доступное только для чтения поле может передаваться как параметр с ключевым словом ref или out только в конструкторе
zh_hant: ref 或 out 無法傳遞唯讀欄位 (除非在建構函式)

# AssgReadonlyStatic
source: A static readonly field cannot be assigned to (except in a static constructor or a variable initializer)
it: Impossibile effettuare un'assegnazione a un campo statico in sola lettura (tranne che in un costruttore statico o in un inizializzatore di variabile).
ru: Присваивание значений доступному только для чтения статическому полю допускается только в статическом конструкторе и в инициализаторе переменных
zh_hant: 無法指定靜態唯讀欄位 (除非在靜態建構函式或變數初始設定式)

# RefReadonlyStatic
source: A static readonly field cannot be passed ref or out (except in a static constructor)
it: Impossibile passare un parametro ref o out a un campo statico in sola lettura (tranne che in un costruttore statico).
ru: Доступное только для чтения статическое поле может передаваться как параметр с ключевым словом ref или out только в статическом конструкторе
zh_hant: ref 或 out 無法傳遞靜態唯讀欄位 (除非在靜態建構函式)

# AssgReadonlyProp
source: Property or indexer '{0}' cannot be assigned to -- it is read only
it: Impossibile assegnare un valore alla proprietà o all'indicizzatore '{0}' perché è di sola lettura
ru: Невозможно присвоить значение свойству или индексатору "{0}" -- доступ только для чтения
zh_hant: 無法指派屬性或索引子 '{0}' -- 其為唯讀

# AbstractBaseCall
source: Cannot call an abstract base member: '{0}'
it: Impossibile chiamare un membro di base astratto: '{0}'
ru: Не удается вызвать абстрактный член базового класса: "{0}"
zh_hant: 無法呼叫抽象基底成員: '{0}'

# RefProperty
source: A property or indexer may not be passed as an out or ref parameter
it: Una proprietà o un indicizzatore non può essere passato come parametro out o ref
ru: Свойства и индексаторы не могут передаваться как параметры с ключевыми словами out и ref
zh_hant: 無法將屬性或索引子當做 out 或 ref 參數傳遞

# ManagedAddr
source: Cannot take the address of, get the size of, or declare a pointer to a managed type ('{0}')
it: Impossibile accettare l'indirizzo di un tipo gestito ('{0}'), recuperarne la dimensione o dichiarare un puntatore a esso
ru: Невозможно получить адрес, определить размер или объявить указатель на управляемый тип ("{0}")
zh_hant: 不能取得 Managed 型別 ('{0}') 的位址、大小，也不能宣告指向它的指標

# FixedNotNeeded
source: You cannot use the fixed statement to take the address of an already fixed expression
it: Impossibile utilizzare l'istruzione fixed per accettare l'indirizzo di un'espressione già di tipo fixed
ru: Получить адрес фиксированного выражения с помощью оператора fixed невозможно
zh_hant: 您不能使用 fixed 陳述式來取得原本就是 fixed 運算式的位址

# UnsafeNeeded
source: Dynamic calls cannot be used in conjunction with pointers
it: Impossibile utilizzare le chiamate dinamiche insieme ai puntatori
ru: Динамические вызовы нельзя использовать в сопряжении с указателями
zh_hant: 動態呼叫不能與指標一起使用

# BadBoolOp
source: In order to be applicable as a short circuit operator a user-defined logical operator ('{0}') must have the same return type as the type of its 2 parameters
it: Per essere utilizzato come operatore di corto circuito, un operatore logico definito dall'utente ('{0}') deve avere lo stesso tipo restituito dei 2 parametri
ru: Для использования в качестве логического оператора краткой записи тип возвращаемого значения пользовательского логического оператора ("{0}") должен быть аналогичен типам двух его параметров
zh_hant: 為了可以當成最少運算 (Short Circuit) 運算子使用，使用者定義的邏輯運算子 ('{0}') 其傳回型別必須與其 2 個參數的型別相同

# MustHaveOpTF
source: The type ('{0}') must contain declarations of operator true and operator false
it: Il tipo ('{0}') deve contenere dichiarazioni di operatore true e operatore false.
ru: Тип ("{0}") должен содержать объявления оператора true и оператора false
zh_hant: 型別 ('{0}') 必須包含運算子 true 和運算子 false 的宣告

# CheckedOverflow
source: The operation overflows at compile time in checked mode
it: L'operazione di overflow in fase di compilazione in modalità checked
ru: Операция вызывает переполнение во время компиляции в проверяемом режиме
zh_hant: 操作在檢查模式下編譯時溢出

# ConstOutOfRangeChecked
source: Constant value '{0}' cannot be converted to a '{1}' (use 'unchecked' syntax to override)
it: Il valore costante '{0}' non può essere convertito in '{1}' (utilizzare la sintassi 'unchecked' per eseguire l'override).
ru: Постоянное значение "{0}" не может быть преобразовано в "{1}" (для обхода используйте синтаксис "unchecked")
zh_hant: 無法將常數值 '{0}' 轉換為 '{1}' (請使用 'unchecked' 語法覆寫)

# AmbigMember
source: Ambiguity between '{0}' and '{1}'
it: Ambiguità tra '{0}' e '{1}'
ru: Неоднозначность между "{0}" и "{1}"
zh_hant: '{0}' 和 '{1}' 之間模稜兩可

# SizeofUnsafe
source: '{0}' does not have a predefined size, therefore sizeof can only be used in an unsafe context (consider using System.Runtime.InteropServices.Marshal.SizeOf)
it: '{0}' non ha una dimensione predefinita, quindi sizeof può essere utilizzato solo in un contesto di tipo unsafe. Si consiglia di utilizzare System.Runtime.InteropServices.Marshal.SizeOf.
zh_hant: '{0}' 沒有預先定義的大小，因此 sizeof 只能使用於 unsafe 內容 (可考慮使用 System.Runtime.InteropServices.Marshal.SizeOf)

# FieldInitRefNonstatic
source: A field initializer cannot reference the non-static field, method, or property '{0}'
it: Un inizializzatore di campo non può fare riferimento alla proprietà, al metodo o al campo non statico '{0}'
ru: Инициализатор поля не может обращаться к нестатическому полю, методу или свойству "{0}"
zh_hant: 欄位初始設定式無法參考非靜態欄位、方法或屬性 '{0}'

# CallingFinalizeDepracated
source: Destructors and object.Finalize cannot be called directly. Consider calling IDisposable.Dispose if available.
it: Impossibile chiamare direttamente i distruttori e object.Finalize. Provare a chiamare IDisposable.Dispose se disponibile.
ru: Непосредственный вызов деструкторов и функций object.Finalize запрещен. Рекомендуется вызов IDisposable.Dispose, если она доступна.
zh_hant: 不能直接呼叫解構函式和 object.Finalize。請考慮呼叫 IDisposable.Dispose (如果有)。

# CallingBaseFinalizeDeprecated
source: Do not directly call your base class Finalize method. It is called automatically from your destructor.
it: Non chiamare direttamente il metodo Finalize della classe base. Viene chiamato automaticamente dal distruttore.
ru: Не вызывайте метод Finalize базового класса напрямую. Он вызывается автоматически из деструктора.
zh_hant: 不要直接呼叫您的基底類別 Finalize 方法。會從您的解構函式自動呼叫它。

# BadCastInFixed
source: The right hand side of a fixed statement assignment may not be a cast expression
it: La parte destra dell'assegnazione di un'istruzione fixed non può essere un'espressione cast
ru: Правая часть присваивания оператора fixed не может быть выражением приведения типа
zh_hant: fixed 陳述式設定運算子的右邊不能是 cast 運算式

# NoImplicitConvCast
source: Cannot implicitly convert type '{0}' to '{1}'. An explicit conversion exists (are you missing a cast?)
it: Impossibile convertire in modo implicito il tipo '{0}' in '{1}'. È presente una conversione esplicita. Probabile cast mancante.
ru: Не удается неявно преобразовать тип "{0}" в "{1}". Существует явное преобразование (требуется приведение типа?)
zh_hant: 無法將型別 '{0}' 隱含轉換為 '{1}'。已有明確轉換存在 (您是否漏掉了轉型?)

# InaccessibleGetter
source: The property or indexer '{0}' cannot be used in this context because the get accessor is inaccessible
it: Impossibile utilizzare la proprietà o l'indicizzatore '{0}' in questo contesto perché la funzione di accesso get è inaccessibile.
ru: Свойство или индексатор "{0}" невозможно использовать в данном контексте, поскольку метод доступа get недоступен
zh_hant: 這個內容中不能使用屬性或索引子 '{0}'，因為無法存取 get 存取子

# InaccessibleSetter
source: The property or indexer '{0}' cannot be used in this context because the set accessor is inaccessible
it: Impossibile utilizzare la proprietà o l'indicizzatore '{0}' in questo contesto perché la funzione di accesso set è inaccessibile.
ru: Свойство или индексатор "{0}" невозможно использовать в данном контексте, поскольку метод доступа set недоступен
zh_hant: 這個內容中不能使用屬性或索引子 '{0}'，因為無法存取 set 存取子

# BadArity
source: Using the generic {1} '{0}' requires '{2}' type arguments
it: L'utilizzo del {1} generico '{0}' richiede argomenti di tipo '{2}'
ru: Использование универсального {1} "{0}" требует аргументов типа "{2}"
zh_hant: 使用泛型 {1} '{0}' 需要 '{2}' 個型別引數

# BadTypeArgument
source: The type '{0}' may not be used as a type argument
it: Il tipo '{0}' non può essere utilizzato come argomento di tipo
ru: Тип '{0}' не может использоваться в качестве аргумента типа
zh_hant: 類型"{0}"不可能用作類型參數

# TypeArgsNotAllowed
source: The {1} '{0}' cannot be used with type arguments
it: Impossibile utilizzare {1} '{0}' insieme ad argomenti di tipo
ru: {1} "{0}" не может использоваться с аргументами типа
zh_hant: {1} '{0}' 不能配合型別引數使用

# HasNoTypeVars
source: The non-generic {1} '{0}' cannot be used with type arguments
it: Impossibile utilizzare {1} non generico '{0}' insieme ad argomenti di tipo
ru: Неуниверсальный {1} "{0}" не может использоваться с аргументами типа
zh_hant: 非泛型 {1} '{0}' 不能配合型別引數使用

# NewConstraintNotSatisfied
source: '{2}' must be a non-abstract type with a public parameterless constructor in order to use it as parameter '{1}' in the generic type or method '{0}'
it: '{2}' deve essere un tipo non astratto con un costruttore pubblico senza parametri per essere utilizzato come parametro '{1}' nel tipo o nel metodo generico '{0}'
ru: "Для использования в качестве параметра "{1}" в универсальном типе или методе "{0}" тип "{2}" должен быть неабстрактным и иметь открытый конструктор без параметров
zh_hant: '{2}' 必須是具有公用無參數建構函式的非抽象型別，才能在泛型型別或方法 '{0}' 中做為參數 '{1}' 使用

# GenericConstraintNotSatisfiedRefType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no implicit reference conversion from '{3}' to '{1}'.
it: Impossibile utilizzare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Nessuna conversione implicita di riferimenti da '{3}' a '{1}'.
ru: Невозможно использовать тип "{3}" в качестве параметра типа "{2}" в универсальном типе или методе "{0}". Нет неявного преобразования ссылки из "{3}" в "{1}".
zh_hant: 型別 '{3}' 不能做為泛型型別或方法 '{0}' 中的型別參數 '{2}'。沒有從 '{3}' 到 '{1}' 的隱含參考轉換。

# GenericConstraintNotSatisfiedNullableEnum
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'.
it: Impossibile utilizzare il tipo '{3}' come parametro di tipo '{2}' nel tipo o metodo generico '{0}'. Il tipo nullable '{3}' non soddisfa il vincolo di '{1}'.
ru: Невозможно использовать тип "{3}" в качестве параметра типа "{2}" в универсальном типе или методе "{0}". Для типа "{3}", допускающего значение null, не выполняется ограничение "{1}".
zh_hant: 型別 '{3}' 不能做為泛型型別或方法 '{0}' 中的型別參數 '{2}'。可為 Null 的型別 '{3}' 未滿足 '{1}' 的條件約束。

# GenericConstraintNotSatisfiedNullableInterface
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'. Nullable types can not satisfy any interface constraints.
it: Impossibile utilizzare il tipo '{3}' come parametro di tipo '{2}' nel tipo o metodo generico '{0}'. Il tipo nullable '{3}' non soddisfa il vincolo di '{1}'. I tipi nullable non soddisfano i vincoli di interfaccia.
ru: Невозможно использовать тип "{3}" в качестве параметра типа "{2}" в универсальном типе или методе "{0}". Для типа "{3}", допускающего значение null, не выполняется ограничение "{1}". Типы, допускающие значение null, не могут удовлетворять ни одному интерфейсному ограничению.
zh_hant: 型別 '{3}' 不能做為泛型型別或方法 '{0}' 中的型別參數 '{2}'。可為 Null 的型別 '{3}' 未滿足 '{1}' 的條件約束。可為 Null 的型別無法滿足所有介面條件約束。

# GenericConstraintNotSatisfiedTyVar
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion or type parameter conversion from '{3}' to '{1}'.
it: Impossibile utilizzare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Nessuna conversione boxing o conversione di parametri di tipo da '{3}' a '{1}'.
ru: Невозможно использовать тип "{3}" в качестве параметра типа "{2}" в универсальном типе или методе "{0}". Нет преобразования-упаковки или преобразования типа параметра из "{3}" в "{1}".
zh_hant: 型別 '{3}' 不能做為泛型型別或方法 '{0}' 中的型別參數 '{2}'。沒有從 '{3}' 到 '{1}' 的 Boxing 轉換或型別參數轉換。

# GenericConstraintNotSatisfiedValType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion from '{3}' to '{1}'.
it: Impossibile utilizzare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Nessuna conversione boxing da '{3}' a '{1}'.
ru: Невозможно использовать тип "{3}" в качестве параметра типа "{2}" в универсальном типе или методе "{0}". Нет преобразования-упаковки из "{3}" в "{1}".
zh_hant: 型別 '{3}' 不能做為泛型型別或方法 '{0}' 中的型別參數 '{2}'。沒有從 '{3}' 到 '{1}' 的 Boxing 轉換。

# TypeVarCantBeNull
source: Cannot convert null to type parameter '{0}' because it could be a non-nullable value type. Consider using 'default({0})' instead.
it: Impossibile convertire il valore Null nel parametro di tipo '{0}' perché potrebbe essere un tipo di valore non nullable. Si consiglia di utilizzare 'default({0})'.
ru: Cannot convert null to type parameter "{0}" because it could be a non-nullable value type. Вместо этого рекомендуется использовать "default({0})".
zh_hant: 無法將 null 轉換成型別參數 '{0}'，因為它是不可為 null 的實值型別。請考慮使用 'default({0})' 代替。

# BadRetType
source: '{1} {0}' has the wrong return type
it: Il tipo restituito di '{1} {0}' è errato
ru: "{1} {0}" имеет неправильный возвращаемый тип
zh_hant: '{1} {0}' 的傳回型別錯誤
